[
  {"id":"2023","abstract":"In mathematics, the moments of a function are certain quantitative measures related to the shape of the function's graph. If the function represents mass density, then the zeroth moment is the total mass, the first moment (normalized by total mass) is the center of mass, and the second moment is the moment of inertia. If the function is a probability distribution, then the first moment is the expected value, the second central moment is the variance, the third standardized moment is the skewness, and the fourth standardized moment is the kurtosis. The mathematical concept is closely related to the concept of moment in physics.\nFor a distribution of mass or probability on a bounded interval, the collection of all the moments (of all orders, from 0 to ∞) uniquely determines the distribution (Hausdorff moment problem).  The same is not true on unbounded intervals (Hamburger moment problem).\nIn the mid-nineteenth century, Pafnuty Chebyshev became the first person to think systematically in terms of the moments of random variables.","accessed":{"date-parts":[["2023",11,9]]},"citation-key":"2023","container-title":"Wikipedia","issued":{"date-parts":[["2023",6,17]]},"language":"en","license":"Creative Commons Attribution-ShareAlike License","note":"Page Version ID: 1160595776","source":"Wikipedia","title":"Moment (mathematics)","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Moment_(mathematics)&oldid=1160595776"},
  {"id":"2023a","abstract":"In probability theory and statistics, skewness is a measure of the asymmetry of the probability distribution of a real-valued random variable about its mean. The skewness value can be positive, zero, negative, or undefined.\nFor a unimodal distribution, negative skew commonly indicates that the tail is on the left side of the distribution, and positive skew indicates that the tail is on the right. In cases where one tail is long but the other tail is fat, skewness does not obey a simple rule. For example, a zero value means that the tails on both sides of the mean balance out overall; this is the case for a symmetric distribution, but can also be true for an asymmetric distribution where one tail is long and thin, and the other is short but fat.","accessed":{"date-parts":[["2023",11,9]]},"citation-key":"2023a","container-title":"Wikipedia","issued":{"date-parts":[["2023",11,8]]},"language":"en","license":"Creative Commons Attribution-ShareAlike License","note":"Page Version ID: 1184083610","source":"Wikipedia","title":"Skewness","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Skewness&oldid=1184083610"},
  {"id":"2023b","abstract":"In probability theory and statistics, a standardized moment of a probability distribution is a moment (often a higher degree central moment) that is normalized, typically by a power of the standard deviation, rendering the moment scale invariant. The shape of different probability distributions can be compared using standardized moments.","accessed":{"date-parts":[["2023",11,9]]},"citation-key":"2023b","container-title":"Wikipedia","issued":{"date-parts":[["2023",1,3]]},"language":"en","license":"Creative Commons Attribution-ShareAlike License","note":"Page Version ID: 1131377470","source":"Wikipedia","title":"Standardized moment","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Standardized_moment&oldid=1131377470"},
  {"id":"2023c","abstract":"Dans un test statistique, la valeur-p (en anglais p-value pour probability value), parfois aussi appelée p-valeur, est la probabilité pour un modèle statistique donné sous l'hypothèse nulle d'obtenir une valeur au moins aussi extrême que celle observée.\nL'usage de la valeur-p est courant dans de nombreux domaines de recherche comme la physique, la psychologie, l'économie et les sciences de la vie.","accessed":{"date-parts":[["2023",11,10]]},"citation-key":"2023c","container-title":"Wikipédia","issued":{"date-parts":[["2023",2,15]]},"language":"fr","license":"Creative Commons Attribution-ShareAlike License","note":"Page Version ID: 201421523","source":"Wikipedia","title":"Valeur p","type":"entry-encyclopedia","URL":"https://fr.wikipedia.org/w/index.php?title=Valeur_p&oldid=201421523"},
  {"id":"bain1992","author":[{"family":"Bain","given":"Lee J."},{"family":"Engelhardt","given":"Max"}],"call-number":"QA273 .B2546 1991","citation-key":"bain1992","collection-title":"The Duxbury advanced series in statistics and decision sciences","edition":"2nd ed","event-place":"Boston","ISBN":"978-0-534-92930-5 978-0-534-98563-9","issued":{"date-parts":[["1992"]]},"language":"en","number-of-pages":"644","publisher":"PWS-KENT Pub","publisher-place":"Boston","source":"Library of Congress ISBN","title":"Introduction to probability and mathematical statistics","type":"book"},
  {"id":"boschen2021","accessed":{"date-parts":[["2023",11,28]]},"author":[{"family":"Boschen","given":"Dan"}],"citation-key":"boschen2021","container-title":"Signal Processing Stack Exchange","issued":{"date-parts":[["2021",12,30]]},"title":"Answer to \"about PSD scailing factor\"","type":"post","URL":"https://dsp.stackexchange.com/a/80812"},
  {"id":"brauchler2022","abstract":"The identification of material parameters of classical guitars is particularly interesting as the orthotropic material parameters of wood vary largely and lead to hearable differences even in seemingly identical instruments. Identification methods intended to achieve this task commonly try to fit, e.g., finite element models to experimental data by minimizing a given objective function, and typically return precise parameter values. However, such one-point estimators do not contain much information with respect to the uncertainty that may remain regarding the true values – irrespective of whether such a ground truth can be assumed at all. Model updating techniques that also intend to quantify these uncertainties typically require the practitioner to specify a statistical model of the experiment, which is not easily formulated. Moreover, virtually all uncertainty quantification techniques require a high number of model evaluations, which is diametrically opposed to the long evaluation times of high-fidelity finite element models. In this contribution, an alternative technique for uncertainty quantification based on possibility theory is proposed and applied to a classical guitar. Only requiring the practitioner to specify an objective function, which may be identical to the one used to find point estimates, it is readily accessible and straightforward to apply. Great emphasis is put on the construction of a high-fidelity guitar model and the construction of suitable surrogate models via parametric model order reduction based on Krylov subspace methods, which drastically reduces the number of degrees of freedom in the surrogate model of the finite element model while maintaining the parameter dependency. In this manner, model order reduction allows for significant speedups of the model evaluations and, more importantly here, facilitates the uncertainty quantification in the first place. It is demonstrated how this scheme is able to find regions of plausible parameter values of the guitar and how one may distinguish quasi-identical instruments with great confidence, e.g., due to the disjointness of such regions, compared to the moderate confidence implied by more or less disagreeing point estimates. Although motivated by the material parameter identification of guitars, the presented method yields great potential for applicability to inverse problems tackled with finite element models in general.","accessed":{"date-parts":[["2023",10,16]]},"author":[{"family":"Brauchler","given":"Alexander"},{"family":"Hose","given":"Dominik"},{"family":"Ziegler","given":"Pascal"},{"family":"Hanss","given":"Michael"},{"family":"Eberhard","given":"Peter"}],"citation-key":"brauchler2022","container-title":"Journal of Sound and Vibration","container-title-short":"Journal of Sound and Vibration","DOI":"10.1016/j.jsv.2022.117071","ISSN":"0022-460X","issued":{"date-parts":[["2022",9,29]]},"page":"117071","source":"ScienceDirect","title":"Distinguishing geometrically identical instruments: Possibilistic identification of material parameters in a parametrically model order reduced finite element model of a classical guitar","title-short":"Distinguishing geometrically identical instruments","type":"article-journal","URL":"https://www.sciencedirect.com/science/article/pii/S0022460X22002838","volume":"535"},
  {"id":"buen2005","abstract":"Recordings of the sound spectra produced by violins made by Antonio Stradivari (1 5), Giuseppe Guameri del Gesu (1 5), and 18 contemporary makers were analyzed and compared In general, the sound produced by the 30 violins crafted by the two great Italian masters is very strong in the region from about C#q to G4 (274 to 41 0 Hz) and signij7cantly stronger in the highrfiequency regionfrom to G7 (2901 to 3073 Hz) and from B, to G#8 (3868 to 6494 Hz). The particular group of modem violins we ana-lyzed had relatively equal or stronger fundamentals at very low notes below Cq (<260 Hz), in the mid-frequency region A4 to F, (440 to 2793 Hz), and at very high frequencies (>6.5 H z) . Overall, the sound produced by the violins of Stradivari and Guameri was darker, less nasal, somewhat stronger in the high-brightness region, and possibly less sharp than was typical of the modem violins.","author":[{"family":"Buen","given":"Anders"}],"citation-key":"buen2005","container-title":"Proceedings from BNAM","issued":{"date-parts":[["2005",7,1]]},"source":"ResearchGate","title":"Comparing the sound o f golden age and modern violins: long-time-average spectra","title-short":"Comparing the sound o f golden age and modern violins","type":"article-journal"},
  {"id":"buen2006","abstract":"A simplified version of Dünnwalds timbre parameters for Old Italian Violin Sound; L (bass), ACD-B (un-nasality) and DE-F (clarity) are used to compare the sound of 15 Stradivarius and 15 Guarnerius del Gesú violins. The parameters was extracted from 1/12 th octave band played long time average spectra obtained from a CD-recording with the same musical piece played on each of these fine violins. A considerable spread in these parameters and the sound pressure levels were found in both groups of old violins. This spread is used for a direct correlation with the variation in thickness and other geometrical data of some 18 of these Golden age violins. In general, instruments with thinner plates and higher arc height have a statistical tendency of having higher values for L, ACD-B and DE-F and thus sound \"more old Italian\". But these have a tendency of sounding less loud. In particular the border and average thickness of the back plate is lower for violins with high L and ACD-B and the tops are generally thinner for violins with higher values of DE-F. The development of timbre through Guarneri del Gesùs career is: towards less bass, more nasal, more clear and a stronger sound. Stradivari seems to have the opposite development through his longer career; Richer in bass, less nasal and slightly less loud with age. He seems to keep his brilliance through his career.","author":[{"family":"Buen","given":"Anders"}],"citation-key":"buen2006","container-title":"Proceedings from BNAM","issued":{"date-parts":[["2006",11,1]]},"source":"ResearchGate","title":"Can we hear the geometrical measures of a violin?","type":"article-journal"},
  {"id":"caetano2019","accessed":{"date-parts":[["2023",11,9]]},"author":[{"family":"Caetano","given":"Marcelo"},{"family":"Saitis","given":"Charalampos"},{"family":"Siedenburg","given":"Kai"}],"citation-key":"caetano2019","container-title":"Timbre: Acoustics, Perception, and Cognition","DOI":"10.1007/978-3-030-14832-4_11","editor":[{"family":"Siedenburg","given":"Kai"},{"family":"Saitis","given":"Charalampos"},{"family":"McAdams","given":"Stephen"},{"family":"Popper","given":"Arthur N."},{"family":"Fay","given":"Richard R."}],"event-place":"Cham","ISBN":"978-3-030-14831-7 978-3-030-14832-4","issued":{"date-parts":[["2019"]]},"language":"en","page":"297-333","publisher":"Springer International Publishing","publisher-place":"Cham","source":"DOI.org (Crossref)","title":"Audio Content Descriptors of Timbre","type":"chapter","URL":"http://link.springer.com/10.1007/978-3-030-14832-4_11","volume":"69"},
  {"id":"cattani2013","abstract":"To understand how the value of cultural products is determined, one must consider how evaluations evolve over time and have an impact on the conditions supporting knowledge development. If evaluations do not fully recognize the potential value of a cultural product, the associated knowledge—especially tacit knowledge—may be lost rather than passed on, thus jeopardizing subsequent attempts to reproduce the valued product. We examine these dynamics by studying how value was attributed to Cremonese stringed instruments. The value the Cremonese masters created was first recognized in the 16th century, and in the early 18th century, new methods to strengthen instrument sound and sonority were developed. However, the value of these new developments was not widely recognized until the 19th century, when, in evaluating musical performance, performers, critics, and public audiences took over from royal courts, and they selected Cremonese instruments as the best for performing the emerging Romantic music. We consider how the dynamics of value determination over time have implications for knowledge management processes.","accessed":{"date-parts":[["2023",10,16]]},"author":[{"family":"Cattani","given":"Gino"},{"family":"Dunbar","given":"Roger L. M."},{"family":"Shapira","given":"Zur"}],"citation-key":"cattani2013","container-title":"Organization Science","DOI":"10.1287/orsc.1120.0768","ISSN":"1047-7039","issue":"3","issued":{"date-parts":[["2013",6]]},"page":"813-830","publisher":"INFORMS","source":"pubsonline.informs.org (Atypon)","title":"Value Creation and Knowledge Loss: The Case of Cremonese Stringed Instruments","title-short":"Value Creation and Knowledge Loss","type":"article-journal","URL":"https://pubsonline.informs.org/doi/10.1287/orsc.1120.0768","volume":"24"},
  {"id":"charles2006","accessed":{"date-parts":[["2023",10,25]]},"author":[{"family":"Charles","given":"J.A."},{"family":"Fitzgerald","given":"D."},{"family":"Coyle","given":"E."}],"citation-key":"charles2006","container-title":"IET Irish Signals and Systems Conference (ISSC 2006)","DOI":"10.1049/cp:20060481","event-place":"Dublin, Ireland","event-title":"IET Irish Signals and Systems Conference (ISSC 2006)","ISBN":"978-0-86341-665-1","issued":{"date-parts":[["2006"]]},"language":"en","page":"471-476","publisher":"IEE","publisher-place":"Dublin, Ireland","source":"DOI.org (Crossref)","title":"Violin timbre space features","type":"paper-conference","URL":"https://digital-library.theiet.org/content/conferences/10.1049/cp_20060481","volume":"2006"},
  {"id":"charles2008","abstract":"Although much research has been completed on finding features for instrument recognition systems, little work has focused on the violin's timbre space. Suitable features from which a computer can assess the quality of a violinist's playing have been sought and the classification of violin note sound quality is investigated in this paper. The eventual outcome of this work can be applied in various systems including the development of a violin or bowed string instrument teaching aid, in automatic music transcription and information retrieval or classification systems.","accessed":{"date-parts":[["2024",9,28]]},"author":[{"family":"Charles","given":"J. A."},{"family":"Fitzgerald","given":"D."},{"family":"Coyle","given":"E."}],"citation-key":"charles2008","container-title":"IET Irish Signals and Systems Conference (ISSC 2008)","DOI":"10.1049/cp:20080676","event-title":"IET Irish Signals and Systems Conference (ISSC 2008)","ISSN":"0537-9989","issued":{"date-parts":[["2008",6]]},"page":"282-287","source":"IEEE Xplore","title":"Violin sound quality detection","type":"paper-conference","URL":"https://ieeexplore.ieee.org/document/4780967"},
  {"id":"decheveigne2002","author":[{"family":"Cheveigne","given":"Alain","non-dropping-particle":"de"},{"family":"Kawahara","given":"Hideki"}],"citation-key":"decheveigne2002","container-title":"J. Acoust. Soc. Am.","issue":"4","issued":{"date-parts":[["2002"]]},"language":"en","source":"Zotero","title":"YIN, a fundamental frequency estimator for speech and musica)","type":"article-journal","volume":"111"},
  {"id":"dimitriy2012","accessed":{"date-parts":[["2024",9,22]]},"author":[{"family":"dimitriy","given":""}],"citation-key":"dimitriy2012","container-title":"Cross Validated","issued":{"date-parts":[["2012",10,16]]},"title":"Answer to \"How can I explain the intuition behind ANOVA?\"","title-short":"Answer to \"How can I explain the intuition behind ANOVA?","type":"post","URL":"https://stats.stackexchange.com/a/40558"},
  {"id":"eronen2000","abstract":"In this paper, a system for pitch independent musical instrument recognition is presented. A wide set of features covering both spectral and temporal properties of sounds was investigated, and their extraction algorithms were designed. The usefulness of the features was validated using test data that consisted of 1498 samples covering the full pitch ranges of 30 orchestral instruments from the string, brass and woodwind families, played with different techniques. The correct instrument family was recognized with 94% accuracy and individual instruments in 80% of cases. These results are compared to those reported in other work. Also, utilization of a hierarchical classification framework is considered.","accessed":{"date-parts":[["2024",5,7]]},"author":[{"family":"Eronen","given":"A."},{"family":"Klapuri","given":"A."}],"citation-key":"eronen2000","container-title":"2000 IEEE International Conference on Acoustics, Speech, and Signal Processing. Proceedings (Cat. No.00CH37100)","DOI":"10.1109/ICASSP.2000.859069","event-title":"2000 IEEE International Conference on Acoustics, Speech, and Signal Processing. Proceedings (Cat. No.00CH37100)","ISSN":"1520-6149","issued":{"date-parts":[["2000",6]]},"page":"II753-II756 vol.2","source":"IEEE Xplore","title":"Musical instrument recognition using cepstral coefficients and temporal features","type":"paper-conference","URL":"https://ieeexplore.ieee.org/document/859069","volume":"2"},
  {"id":"essid2006","abstract":"Musical instrument recognition is an important aspect of music information retrieval. In this paper, statistical pattern recognition techniques are utilized to tackle the problem in the context of solo musical phrases. Ten instrument classes from different instrument families are considered. A large sound database is collected from excerpts of musical phrases acquired from commercial recordings translating different instrument instances, performers, and recording conditions. More than 150 signal processing features are studied including new descriptors. Two feature selection techniques, inertia ratio maximization with feature space projection and genetic algorithms are considered in a class pairwise manner whereby the most relevant features are fetched for each instrument pair. For the classiﬁcation task, experimental results are provided using Gaussian mixture models (GMMs) and support vector machines (SVMs). It is shown that higher recognition rates can be reached with pairwise optimized subsets of features in association with SVM classiﬁcation using a radial basis function kernel.","accessed":{"date-parts":[["2024",8,30]]},"author":[{"family":"Essid","given":"S."},{"family":"Richard","given":"G."},{"family":"David","given":"B."}],"citation-key":"essid2006","container-title":"IEEE Transactions on Audio, Speech and Language Processing","container-title-short":"IEEE Trans. Audio Speech Lang. Process.","DOI":"10.1109/TSA.2005.860842","ISSN":"1558-7916","issue":"4","issued":{"date-parts":[["2006",7]]},"language":"en","license":"https://ieeexplore.ieee.org/Xplorehelp/downloads/license-information/IEEE.html","page":"1401-1412","source":"DOI.org (Crossref)","title":"Musical instrument recognition by pairwise classification strategies","type":"article-journal","URL":"http://ieeexplore.ieee.org/document/1643665/","volume":"14"},
  {"id":"farina1995","abstract":"In this paper the realisation of \"virtual\" musical instruments is analysed, in which the instruments are treated as linear systems, characterised by their impulse response. Various measurements techniques of the impulse response have been tested, employing different transducers and numerical analysis. The better one resulted the direct Maximum Length Sequence excitation signal, applied to the bridge of the violin by a current-to-force transducer. The acoustic pressure radiated from the violin's body is then sampled by a microphone located in an anechoic chamber, and the Impulse Response is obtained by cross-correlation of the acoustic signal with the excitation signal. The impulse responses measured with the technique presented in this paper contain all the timbric and reverberant characteristics of the violin. Langhoff already developed a rating technique that make it possible to extract objective informations about the timbric quality of violins (1): the scope of the present work is to evaluate also the reverberant quality of the instruments. Furthermore, the measurement of the impulse response enables the creation of a \"virtual\" violin, which is a numerical filter that applied by convolution to an \"anechoic\" signal add to it all its information. The techniques to obtain such samples of \"anechoic\" input signals are also discussed here.","author":[{"family":"Farina","given":"Angelo"},{"family":"Langhoff","given":"Andreas"},{"family":"Tronchin","given":"Lamberto"}],"citation-key":"farina1995","issued":{"date-parts":[["1995",1,1]]},"source":"ResearchGate","title":"Realisation of \"virtual\" musical instruments: measurements of the Impulse Response of Violins using MLS technique","title-short":"Realisation of \"virtual\" musical instruments","type":"article-journal"},
  {"id":"farina2000","abstract":"The subjective judgements on ancient violin are influenced by non acoustic phenomena, as the knowledge of the violin maker, the vision of the instruments and, for the performer, also the touch of the violin, the degree of conservation of the instrument, etc. Listening to “virtual” instruments let us to consider subjective evaluations in rapid sequences based only on acoustic events, without variation of other parameters, as performer playing, or kind of music, room acoustic, etc. During this study, four “anechoic” music samples (Paganini, Bach, Mozart, Paganini), kindly played by Maestro Marco Fornaciari, were digitally recorded. He played on 3 different instruments in an anechoic chamber. Simultaneously the violin bridgeexcitation and the acoustic response of the sound chest were digitally recorded on a two channels DAT , using a velocity transducer and a free field microphone. Subjective pair tests were conducted, to determine the validity of the “virtual instrument” technique for comparison with recordings made with the actual different instruments. An arbitrary sequence of “real” acoustic signal pairs, convoluted pairs and control pairs (“truly equal” and “truly different” pairs) was created. The results of the listening tests confirmed the excellent degree of similarity between the direct acoustic recording and convolution technique; furthermore the analysis of the two control groups validates the significativity of the test. These results suggest that it will be possible to correlate subjective evaluations and physical characteristics of the instruments, by using the convolution technique. 1 Convolution by Frequency Domain Processing Since some years specialised hardware to perform continuous delayed convolution exist [1], but they are still very expensive and don’t allow easily to digitally transfer the input and output signals on a PC. These devices are using Frequency Domain Processing with large blocks of data, resulting in a delay that is 3-4 times larger than the impulse response length. Time domain processing DSP boards, on the other hand, are capable of time domain convolution with no delay, but are limited to a few thousands of filter taps (in the better cases). In this work a software fast convolver (Aurora), running on a standard PC hardware, was employed. The Aurora system make use of a very different approach: both the input and output data files are stored on the hard disk in standard WAV format and, once convolution is performed, comparative tests can easily be conducted with just a “point and click” delay. Convolution is performed through the well known “select-save” algorithm [2]: details and performances of the convolution software were already published in [3]. Now the program has been extended to longer impulse responses (up to 200000 taps) and speeded up a lot. This way it can handle the binaural reverberation simulation of large acoustic spaces [4]. 2. Validation of the inverse filtering to recover the “anechoic” input signal To validate the procedure of extracting the “anechoic” impulse signal from the microphone recordings taken in an anechoic chamber, a preliminary test was conducted. 4 “anechoic” input signals were recovered from microphone recordings of 4 different music pieces (2 of Paganini, one of Bach and the last of Mozart), with the technique already described in [5]; then they were convoluted with the impulse response of the same violin. These signals resulted almost indistinguishable from the original ones when listened in a normally reverberant space, whilst in headphone listening a little increase in the reverberation can be evidenced for the convoluted signals, for the reasons explained in [5]. In any case, the timbric perception was almost perfect, and this is the most important aspect for violins. 3. Subjective Test to Compare the Acoustic Quality of Violins For a long time many peoples were studying the acoustic characterisation of musical instruments using conventional methods (i.e., by comparing the music played on different instruments); today, by using the novel convolution technique, it is possible to correlate the objective acoustic properties of violins with subjective evaluations without the need to collect dozens of performance recordings over different instruments. To test the feasibility and robustness of the new technique, a large pair comparison test was conducted, with the aim to evaluate the subjective perceptibility of differences among different instruments. Four different Instruments were employed for this test: the first is an ancient Violin (Klotz), kindly offered from the Cremona’s making school, the second is an other ancient Violin, (Calcanius), and the last violin is a Langhoff. At the end, a very different timbric Instrument, a viola, was utilised to create “really different” pairs. Two “anechoic” samples were used for the test: a music piece of Paganini and one of Bach. The music pieces were kindly played by Maestro Marco Fornaciari. The “anechoic” input samples were obtained by deconvolution of the impulse response of the Langhoff’s violin from the pressure signals directly recorded in anechoic chamber during the music playing, as already described in [5]. The “anechoic” input samples so obtained were convoluted with the measured impulse responses of the different instruments. Thus 3 pairs of convoluted samples were obtained. At the other hand, 3 pairs of “microphonic pieces” were added to the set of data, in which the presentation order was randomly shuffled. To obtain comparison data, two “control groups” each of 3 pairs of samples were mixed with the “true comparisons” set: 3 “really equal” pairs (obtained playing twice the same sample) and 3 “really different” pairs (obtained with convoluted pairs in which each violin is compared to the viola). The same iteration was repeated for each kind of music: Paganini and Bach, in order to get 24 total pairs. 9 subjects were asked to listen to the 24 pairs, filling up for each pair the following questionnaire: Pair no. .......... Are the two violins A and B the same? yes π no π If Your response is no, explain why: a lot (-2) slightly (-1) no difference (0) slightly (+1) a lot (+2) A is better π π π π π B is better A has more pronounced bass π π π π π B has more pronounced bass A has more pronounced treble π π π π π B has more pronounced treble A is softer π π π π π B is softer 3.1 Subjective results The following table summarises the results of the first question (percentage of “equality”): Convoluted samples Microphonic samples Truly equal samples Truly different samples 14.6 % 12.5 % 75 % 0 % These percentages show that convoluted simulations have actually almost the same degree of dissimilarity as microphonic recording. But the truly equal and truly different samples are clearly recognised by the listeners. Analysing the other 4 responses, the following three tables are obtained for the three violins studied, showing the average value and the standard deviation of each response: Langhoff Violin Conv. samples Microph. samples Equal samples Different samples better -0.69 ± 0.83 -0.28 ± 1.01 0.0 ± 0.71 0.37 ± 1.41 pronounced bass -0.28 ± 0.81 -0.31± 0.98 0.0 ± 0.35 −0.56 ± 1.22 pronounced treble -0.37 ± 1.01 0.0 ± 1.05 0.0 ± 0.50 1.44 ± 0.93 soft -0.16 ± 1.18 -0.19 ± 1.11 0.06 ± 0.56 -0.75 ± 0.97 Klotz Violin Conv. samples Microph. samples Equal samples Different samples better -0.16 ± 1.17 -0.03 ± 1.01 0.19 ± 0.39 0.75 ± 1.48 pronounced bass 0.34 ± 0.93 0.12 ± 1.25 -0.13 ± 0.33 -1.06 ± 0.97 pronounced treble -0.19 ± 1.03 -0.09 ± 1.05 0.13 ± 0.48 1.25 ± 0.83 soft 0.03 ± 1.03 0.09 ± 1.06 -0.06 ± 0.43 -0.75 ± 1.20 Calcanius Violin Conv. samples Microph. samples Equal samples Different samples better 0.44 ± 1.05 0.72 ± 1.17 -0.13 ± 0.48 0.12 ± 1.05 pronounced bass -0.03 ± 1.10 0.16 ± 1.05 -0.19 ± 0.53 -1.06 ± 0.97 pronounced treble 0.19 ± 0.93 0.47 ± 1.06 0.19 ± 0.53 1.25 ± 0.83 soft 0.16 ± 1.09 0.06 ± 1.17 -0.13 ± 0.60 -0.19 ± 1.18 It can be observed that the values of convoluted samples pairs are very near to those obtained from microphonic samples, as the differences are always lower than the standard deviations. On the other hand, the control groups show very different responses, that approach almost perfectly zero for the truly equal pairs, and exhibit extreme values for the truly different pairs. This effect can be observed in a more evident way by looking at the graphs of fig. 1. The truly equal pairs always show a strong peak on the “0” (equality), while the truly different pairs show an evident trend toward an extreme of the scale. This is due to the fact that actually the viola is a very bad instrument compared to three violins (question n. 1), it has more pronounced bass (question 2), it does not have treble (question 3), and is certainly softer than the violins (question 4).","accessed":{"date-parts":[["2024",5,21]]},"author":[{"family":"Farina","given":"A."},{"family":"Langhoff","given":"A."},{"family":"Tronchin","given":"L."}],"citation-key":"farina2000","issued":{"date-parts":[["2000"]]},"source":"Semantic Scholar","title":"Subjective Comparisons of “Virtual” Violins Obtained by Convolution","type":"paper-conference","URL":"https://www.semanticscholar.org/paper/Subjective-Comparisons-of-%E2%80%9CVirtual%E2%80%9D-Violins-by-Farina-Langhoff/a7373507693545bd34fc273a903a025a43e64dc9"},
  {"id":"fletcher1998","accessed":{"date-parts":[["2024",6,2]]},"author":[{"family":"Fletcher","given":"Neville H."},{"family":"Rossing","given":"Thomas D."}],"citation-key":"fletcher1998","DOI":"10.1007/978-0-387-21603-4","event-place":"New York, NY","ISBN":"978-1-4419-3120-7 978-0-387-21603-4","issued":{"date-parts":[["1998"]]},"language":"en","license":"http://www.springer.com/tdm","publisher":"Springer","publisher-place":"New York, NY","source":"DOI.org (Crossref)","title":"The Physics of Musical Instruments","type":"book","URL":"http://link.springer.com/10.1007/978-0-387-21603-4"},
  {"id":"fritz2012","abstract":"Most violinists believe that instruments by Stradivari and Guarneri “del Gesu” are tonally superior to other violins—and to new violins in particular. Many mechanical and acoustical factors have been proposed to account for this superiority; however, the fundamental premise of tonal superiority has not yet been properly investigated. Player's judgments about a Stradivari's sound may be biased by the violin's extraordinary monetary value and historical importance, but no studies designed to preclude such biasing factors have yet been published. We asked 21 experienced violinists to compare violins by Stradivari and Guarneri del Gesu with high-quality new instruments. The resulting preferences were based on the violinists’ individual experiences of playing the instruments under double-blind conditions in a room with relatively dry acoustics. We found that (\n              i\n              ) the most-preferred violin was new; (\n              ii\n              ) the least-preferred was by Stradivari; (\n              iii\n              ) there was scant correlation between an instrument's age and monetary value and its perceived quality; and (\n              iv\n              ) most players seemed unable to tell whether their most-preferred instrument was new or old. These results present a striking challenge to conventional wisdom. Differences in taste among individual players, along with differences in playing qualities among individual instruments, appear more important than any general differences between new and old violins. Rather than searching for the “secret” of Stradivari, future research might best focused on how violinists evaluate instruments, on which specific playing qualities are most important to them, and on how these qualities relate to measurable attributes of the instruments, whether old or new.","accessed":{"date-parts":[["2023",5,19]]},"author":[{"family":"Fritz","given":"Claudia"},{"family":"Curtin","given":"Joseph"},{"family":"Poitevineau","given":"Jacques"},{"family":"Morrel-Samuels","given":"Palmer"},{"family":"Tao","given":"Fan-Chia"}],"citation-key":"fritz2012","container-title":"Proceedings of the National Academy of Sciences","container-title-short":"Proc. Natl. Acad. Sci. U.S.A.","DOI":"10.1073/pnas.1114999109","ISSN":"0027-8424, 1091-6490","issue":"3","issued":{"date-parts":[["2012",1,17]]},"language":"en","page":"760-763","source":"DOI.org (Crossref)","title":"Player preferences among new and old violins","type":"article-journal","URL":"https://pnas.org/doi/full/10.1073/pnas.1114999109","volume":"109"},
  {"id":"fritz2014","abstract":"An object of study in mechanics for more than three hundred years, the violin has only recently been scienti cally studied from a perceptual point of view. A range of investigations which have been conducted since 2005, complemented by a few studies of other instruments, o ers an illustration of possible methodologies, and serves as a basis for discussing their respective advantages, as well as their limitations and issues. Since methodological choices depend on the goals of the study and of the theoretical (conceptual) choices, this review focuses on new methodologies borrowed from recent research lines developed in contemporary psychology.","author":[{"family":"Fritz","given":"C"},{"family":"Dubois","given":"D"}],"citation-key":"fritz2014","issued":{"date-parts":[["2014"]]},"language":"en","source":"Zotero","title":"On perceptual evaluation of musical instruments: The case of the violin put into perspective","type":"article-journal","volume":"100"},
  {"id":"fritz2014a","abstract":"Many researchers have sought explanations for the purported tonal superiority of Old Italian violins by investigating varnish and wood properties, plate tuning systems, and the spectral balance of the radiated sound. Nevertheless, the fundamental premise of tonal superiority has been investigated scientifically only once very recently, and results showed a general preference for new violins, and that players were unable to reliably distinguish new violins from old. The study was however relatively small in terms of the number of violins tested (six), the time allotted to each player (an hour), and the size of the test space (a hotel room). In this study 10 renowned soloists each blind-tested six Old Italian violins (including five by Stradivari) and six new during two 1h15 sessions – the first in a rehearsal room, the second in a 300-seat concert hall. When asked to choose a violin to replace their own for a hypothetical concert tour, six of the ten soloists chose a new instrument. A single new violin was easily the most-preferred of the 12. On average, soloists rated their favorite new violins more highly than their favorite old for playability, articulation, and projection, and at least equal to old in terms of timbre. Soloists failed to distinguish new from old at better than chance levels. These results confirm and extend those of the earlier study, and present a striking challenge to nearcanonical beliefs about Old Italian violins.","accessed":{"date-parts":[["2023",5,19]]},"author":[{"family":"Fritz","given":"Claudia"},{"family":"Curtin","given":"Joseph"},{"family":"Poitevineau","given":"Jacques"},{"family":"Borsarello","given":"Hugues"},{"family":"Wollman","given":"Indiana"},{"family":"Tao","given":"Fan-Chia"},{"family":"Ghasarossian","given":"Thierry"}],"citation-key":"fritz2014a","container-title":"Proceedings of the National Academy of Sciences","container-title-short":"Proc. Natl. Acad. Sci. U.S.A.","DOI":"10.1073/pnas.1323367111","ISSN":"0027-8424, 1091-6490","issue":"20","issued":{"date-parts":[["2014",5,20]]},"language":"en","page":"7224-7229","source":"DOI.org (Crossref)","title":"Soloist evaluations of six Old Italian and six new violins","type":"article-journal","URL":"https://pnas.org/doi/full/10.1073/pnas.1323367111","volume":"111"},
  {"id":"fritz2017","abstract":"Old Italian violins are routinely credited with playing qualities supposedly unobtainable in new instruments. These qualities include the ability to project their sound more effectively in a concert hall – despite seeming relatively quiet under the ear of the player, compared with new violins. While researchers have long tried to explain the “mystery” of Stradivari‟s sound, it is only recently that studies have addressed the fundamental assumption of tonal superiority. Results from two studies show that under blind conditions experienced violinists tend to prefer playing new violins over Old Italians. Moreover, they are unable to tell new from old at better than chance levels. The current study explores the relative merits of Stradivari and new violins from the perspective of listeners in a hall. Projection and preference are taken as the two broadest criteria by which listeners might meaningfully compare violins: Which violins are heard better, and which are preferred? In two separate experiments, three new violins were compared with three by Stradivari. Projection was tested both with and without orchestral accompaniment. Projection and preference were judged simultaneously by dividing listeners into two groups. Results are unambiguous. The new violins projected better than the Stradivaris, whether tested with orchestra or without; the new violins were generally preferred by the listeners; and the listeners could not reliably distinguish new from old. The single best-projecting violin was considered the loudest under the ear by players, and on average, violins that were quieter under the ear were found to project less well.","accessed":{"date-parts":[["2023",5,19]]},"author":[{"family":"Fritz","given":"Claudia"},{"family":"Curtin","given":"Joseph"},{"family":"Poitevineau","given":"Jacques"},{"family":"Tao","given":"Fan-Chia"}],"citation-key":"fritz2017","container-title":"Proceedings of the National Academy of Sciences","container-title-short":"Proc. Natl. Acad. Sci. U.S.A.","DOI":"10.1073/pnas.1619443114","ISSN":"0027-8424, 1091-6490","issue":"21","issued":{"date-parts":[["2017",5,23]]},"language":"en","page":"5395-5400","source":"DOI.org (Crossref)","title":"Listener evaluations of new and Old Italian violins","type":"article-journal","URL":"https://pnas.org/doi/full/10.1073/pnas.1619443114","volume":"114"},
  {"id":"fritz2021","abstract":"The Bilbao project aimed at relating intrinsic characteristics of the materials (wood density and stiffness) and some geometric characteristics of the violin's constituent part (thicknesses of the plates) with the tonal qualities of the complete violins. To this end, six instruments were carefully built at the Bilbao making school: three instruments with normal backs, each paired with a pliant (thin), normal or resistant (thick) top; similarly, three with normal tops, each paired with a pliant, normal or resistant back. The two examples of normal top paired with normal back serve as a control. Wood for tops and backs were closely matched in density and sound speeds-all tops and backs from the same trees. Greater control was achieved by having all plates and scrolls cut by CNC routers, using the Huberman Stradivari model. The outside surface was not changed as the graduation was performed entirely on the inside surface. In addition, another six instruments were built by six established makers, following a similar procedure but with less constraints on the choice of wood (not the same trees as for the Bilbao set though a similar density was imposed) and on the graduation of the routed plates which was left totally free (but ended in the same range of thicknesses). Finally, another violin built with a very different profile but made by one of the established maker was added to the pool as an outlier. These thirteen violins were then evaluated by twenty players during a free categorisation task and by about 70 listeners (31 violin makers, 26 bow players and 15 others) during a listening test in the Bilbao conservatory auditorium. The tests show very large differences in terms of timbre, playability and volume between the violins, and these differences will be discussed in the light of their construction parameters.","accessed":{"date-parts":[["2024",6,14]]},"author":[{"family":"Fritz","given":"Claudia"},{"family":"Salvador","given":"Víctor"},{"family":"Stoppani","given":"George"}],"citation-key":"fritz2021","container-title":"Conference on Sound Perception","event-title":"Conference on Sound Perception","issued":{"date-parts":[["2021",9,3]]},"language":"en","source":"hal-sfo.ccsd.cnrs.fr","title":"The Bilbao project: searching for relationships between sound and playing properties of violins with their construction parameters","title-short":"The Bilbao project","type":"paper-conference","URL":"https://hal.science/hal-03446713"},
  {"id":"gabrielsson2007","abstract":"LongTime-Average-Spectra (L TAS:es) were recorded of 22 qualityrated violins. The LTAS:es were analyzed by four different methods: weight functions, factor analysis (FA), multidimensional scaling (MDS), and separate correlation analysis. The average difference between the instruments rated highest and lowest was t r ied a s a function weighting tonal quality. This weight function explained 64 70 of the variance of the tonal quality-ratings. Factor analysis and multidimensional scaling in five factor s/dimensions gave approximately the same solutions. The solutions accounted for 74 70 and 44 ' $0 respec t ive ly of the variance of the LTAS:es and for 74 70 and 69 70 respectively of the variance of the tonal quality-ratings. The variations in certain res t r ic ted frequency regions selected by correlation analysis accounted for 7 1-84 70 of the variance in the tonal quality-ratings. The different methods imply that \"strong\" f r e quency components a r e favorable in a low frequency region and in a middle high frequency region, while \"weak\" frequency components a r e favorable in a high frequency region and in a l imited middle frequency region. The resu l t s seem reliable, a t l eas t for the selected instruments.","accessed":{"date-parts":[["2024",7,15]]},"author":[{"family":"Gabrielsson","given":"A."},{"family":"Jansson","given":""}],"citation-key":"gabrielsson2007","issued":{"date-parts":[["2007"]]},"source":"Semantic Scholar","title":"An analysis of long-time-average-spectra of twentytwo quality-rated violins","type":"paper-conference","URL":"https://www.semanticscholar.org/paper/An-analysis-of-long-time-average-spectra-of-violins-Gabrielsson-Jansson/786c0e0b14dd4d005e4b15786936c5070d80dc0b"},
  {"id":"gonzalez","author":[{"family":"González","given":"Pedro Lladó"}],"citation-key":"gonzalez","language":"en","source":"Zotero","title":"A machine learning approach to violin timbre quality classiﬁcation","type":"article-journal"},
  {"id":"gonzalez2021","abstract":"Of all the characteristics of a violin, those that concern its shape are probably the most important ones, as the violin maker has complete control over them. Contemporary violin making, however, is still based more on tradition than understanding, and a definitive scientific study of the specific relations that exist between shape and vibrational properties is yet to come and sorely missed. In this article, using standard statistical learning tools, we show that the modal frequencies of violin tops can, in fact, be predicted from geometric parameters, and that artificial intelligence can be successfully applied to traditional violin making. We also study how modal frequencies vary with the thicknesses of the plate (a process often referred to as plate tuning) and discuss the complexity of this dependency. Finally, we propose a predictive tool for plate tuning, which takes into account material and geometric parameters.","accessed":{"date-parts":[["2024",9,27]]},"author":[{"family":"Gonzalez","given":"Sebastian"},{"family":"Salvi","given":"Davide"},{"family":"Baeza","given":"Daniel"},{"family":"Antonacci","given":"Fabio"},{"family":"Sarti","given":"Augusto"}],"citation-key":"gonzalez2021","container-title":"Scientific Reports","container-title-short":"Sci Rep","DOI":"10.1038/s41598-021-88931-z","ISSN":"2045-2322","issued":{"date-parts":[["2021",5,4]]},"page":"9455","PMCID":"PMC8096844","PMID":"33947897","source":"PubMed Central","title":"A data-driven approach to violin making","type":"article-journal","URL":"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8096844/","volume":"11"},
  {"id":"grey1977","abstract":"Two experiments were performed to evaluate the perceptual relationships between 16 music instrument tones. The stimuli were computer synthesized based upon an analysis of actual instrument tones, and they were perceptually equalized for loudness, pitch, and duration. Experiment 1 evaluated the tones with respect to perceptual similarities, and the results were treated with multidimensional scaling techniques and hierarchic clustering analysis. A three-dimensional scaling solution, well matching the clustering analysis, was found to be interpretable in terms of (1) the spectral energy distribution; (2) the presence of synchronicity in the transients of the higher harmonics, along with the closely related amount of spectral fluctuation within the the tone through time; and (3) the presence of low-amplitude, high-frequency energy in the initial attack segment; an alternate interpretation of the latter two dimensions viewed the cylindrical distribution of clusters of stimulus points about the spectral energy distribution, grouping on the basis of musical instrument family (with two exceptions). Experiment 2 was a learning task of a set of labels for the 16 tones. Confusions were examined in light of the similarity structure for the tones from experiment 1, and one of the family-grouping exceptions was found to be reflected in the difficulty of learning the labels.","accessed":{"date-parts":[["2023",10,25]]},"author":[{"family":"Grey","given":"John M."}],"citation-key":"grey1977","container-title":"The Journal of the Acoustical Society of America","DOI":"10.1121/1.381428","ISSN":"0001-4966, 1520-8524","issue":"5","issued":{"date-parts":[["1977",5,1]]},"language":"en","page":"1270-1277","source":"DOI.org (Crossref)","title":"Multidimensional perceptual scaling of musical timbres","type":"article-journal","URL":"https://pubs.aip.org/jasa/article/61/5/1270/626725/Multidimensional-perceptual-scaling-of-musical","volume":"61"},
  {"id":"guyon","abstract":"Variable and feature selection have become the focus of much research in areas of application for which datasets with tens or hundreds of thousands of variables are available. These areas include text processing of internet documents, gene expression array analysis, and combinatorial chemistry. The objective of variable selection is three-fold: improving the prediction performance of the predictors, providing faster and more cost-effective predictors, and providing a better understanding of the underlying process that generated the data. The contributions of this special issue cover a wide range of aspects of such problems: providing a better deﬁnition of the objective function, feature construction, feature ranking, multivariate feature selection, efﬁcient search methods, and feature validity assessment methods.","author":[{"family":"Guyon","given":"Isabelle"},{"family":"Elisseeff","given":"Andre"}],"citation-key":"guyon","language":"en","source":"Zotero","title":"An Introduction to Variable and Feature Selection","type":"article-journal"},
  {"id":"halvorsen2019","accessed":{"date-parts":[["2024",9,22]]},"author":[{"family":"halvorsen","given":"kjetil","dropping-particle":"b"}],"citation-key":"halvorsen2019","container-title":"Cross Validated","issued":{"date-parts":[["2019",8,20]]},"title":"Answer to \"How can I explain the intuition behind ANOVA?\"","title-short":"Answer to \"How can I explain the intuition behind ANOVA?","type":"post","URL":"https://stats.stackexchange.com/a/422989"},
  {"id":"harris1978","accessed":{"date-parts":[["2023",12,4]]},"author":[{"family":"Harris","given":"F.J."}],"citation-key":"harris1978","container-title":"Proceedings of the IEEE","container-title-short":"Proc. IEEE","DOI":"10.1109/PROC.1978.10837","ISSN":"0018-9219","issue":"1","issued":{"date-parts":[["1978"]]},"language":"en","page":"51-83","source":"DOI.org (Crossref)","title":"On the use of windows for harmonic analysis with the discrete Fourier transform","type":"article-journal","URL":"http://ieeexplore.ieee.org/document/1455106/","volume":"66"},
  {"id":"heinzel","abstract":"This report tries to give a practical overview about the estimation of power spectra/power spectral densities using the DFT/FFT. One point that is emphasized is the relationship between estimates of power spectra and power spectral densities which is given by the eﬀective noise bandwidth (ENBW). Included is a detailed list of common and useful window functions, among them the often neglected ﬂat-top windows. Special highlights are a procedure to test new programs, a table of comprehensive graphs for each window and the introduction of a whole family of new ﬂat-top windows that feature sidelobe suppression levels of up to −248 dB, as compared with −90 dB of the best ﬂat-top windows available until now.","author":[{"family":"Heinzel","given":"G"},{"family":"Rudiger","given":"A"},{"family":"Schilling","given":"R"}],"citation-key":"heinzel","language":"en","source":"Zotero","title":"Spectrum and spectral density estimation by the Discrete Fourier transform (DFT), including a comprehensive list of window functions and some new ﬂat-top windows.","type":"article-journal"},
  {"id":"hogg2019","author":[{"family":"Hogg","given":"Robert V."},{"family":"McKean","given":"Joseph W."},{"family":"Craig","given":"Allen T."}],"call-number":"QA276 .H59 2019","citation-key":"hogg2019","edition":"Eighth edition","event-place":"Boston","ISBN":"978-0-13-468699-8","issued":{"date-parts":[["2019"]]},"language":"en","number-of-pages":"746","publisher":"Pearson","publisher-place":"Boston","source":"Library of Congress ISBN","title":"Introduction to mathematical statistics","type":"book"},
  {"id":"idnavid2019","accessed":{"date-parts":[["2024",9,22]]},"author":[{"family":"idnavid","given":""}],"citation-key":"idnavid2019","container-title":"Cross Validated","issued":{"date-parts":[["2019",8,20]]},"title":"Answer to \"How can I explain the intuition behind ANOVA?\"","title-short":"Answer to \"How can I explain the intuition behind ANOVA?","type":"post","URL":"https://stats.stackexchange.com/a/422873"},
  {"id":"iii2007","abstract":"Detailed derivation of the Discrete Fourier Transform (DFT) and its associated mathematics, including elementary audio signal processing applications and matlab programming examples.","author":[{"family":"III","given":"Julius O. Smith"}],"citation-key":"iii2007","edition":"2nd edition","event-place":"North Charleston","ISBN":"978-0-9745607-4-8","issued":{"date-parts":[["2007",4,13]]},"language":"English","number-of-pages":"322","publisher":"W3K Publishing","publisher-place":"North Charleston","source":"Amazon","title":"Mathematics of the Discrete Fourier Transform (DFT): with Audio Applications ---- Second Edition","title-short":"Mathematics of the Discrete Fourier Transform (DFT)","type":"book"},
  {"id":"inta2005","abstract":"This is a report on the first three years of a long-term experiment designed to measure how two very similar violins change with time. After being constructed ‘in parallel,’ one is stored under controlled conditions in a museum and is played infrequently, while the other is played regularly by a professional musician. Vibro-acoustic measurements were performed on the instruments and parts thereof during and after construction. Playing and listening tests by a panel of experienced violinists were conducted at completion, after three years with no adjustment, and then after minor adjustments were made to the played violin only. Panels of players and listeners rated the two violins at all stages, and all results are consistent with the null hypothesis: at present there is no significant preference for either instrument over a range of categories.","accessed":{"date-parts":[["2024",9,27]]},"author":[{"family":"Inta","given":"R."},{"family":"Smith","given":"John"},{"family":"Wolfe","given":"J."}],"citation-key":"inta2005","issued":{"date-parts":[["2005"]]},"source":"Semantic Scholar","title":"Measurement of the effect on violins of ageing and playing","type":"paper-conference","URL":"https://www.semanticscholar.org/paper/MEASUREMENT-OF-THE-EFFECT-ON-VIOLINS-OF-AGEING-AND-Inta-Smith/5f9f9113436520b3c0965ebeffd46e28731a9add"},
  {"id":"jan","abstract":"An experimental approach to the study of timbre is described. Series of listening tests were performed separately with recordings of violin tones B3, F#4, C5, G5 and D6, played on various quality violins. Two main approaches to the discovering of acoustical correlates of most important perceptual features are described. The first approach is directly focused on interpretation of perceptual spaces using acoustic characteristics. The second one uses selected verbal attributes used by listeners to the description of timbre differences and tries to found their explanation using acoustic characteristics. Method of immersion of acoustic characteristic into perceptual space revealed the importance of the first harmonic, higher harmonics and spectral centre of gravity in all studied tones. The change of their relations (similarity, contradiction, or independence) with changing pitch is also discussed. Mutual relations of verbal attributes sharp, dark, clear and narrow in sounds of five studied tones are discovered; acoustical correlates of the main attributes sharp and narrow are found, compared and discussed. Moreover acoustical correlates of attribute rustle in high violin tones are mentioned. Findings of both approaches to the study of timbre are compared and discussed.","author":[{"family":"Jan","given":"Stepanek"},{"family":"Zdenek","given":"Otcenasek"}],"citation-key":"jan","language":"en","source":"Zotero","title":"Acoustical correlates of the main features of violin timbre perception","type":"article-journal"},
  {"id":"jansson1997","abstract":"The present i.nvestigation was made with one question in mind: Do high quality violins have properties that cannot be found m vlOhns ofr~lO.d~ratequality? The violins ofthe Jiirmlker Foundation (ofthe Royal Swedish Academy of Music) offer a um~~e ~os~lb~Ity}~ ~eek the.;.nswer to this question - the foundation has a number of high quality (soloist quality) violins in the Stockholm area. Twenty-live ohhese viO\"rr~swere testeoln the fa60ratory rsy means oracrrrrrri'ltrrc-e' measurements at the bridge, level and phase. Thereby it was found that the C3-resonance was dominating and is probably a major parameter of the low frequency response of a high quality violin. Comparisons with other investigations support the view that the quality criteria developed earlier are applicable and that the main body resonance, the B I-resonance and the C3-resonance are the same.","author":[{"family":"Jansson","given":"E V"}],"citation-key":"jansson1997","container-title":"Acta Acustica","issued":{"date-parts":[["1997"]]},"language":"en","source":"Zotero","title":"Admittance Measurements of 25 High Quality Violins","type":"article-journal","volume":"83"},
  {"id":"jansson2007","abstract":"Semantic Scholar extracted view of \"Long-time-average-spectra applied to analysis of music\" by Jansson","accessed":{"date-parts":[["2024",7,15]]},"author":[{"family":"Jansson","given":""}],"citation-key":"jansson2007","issued":{"date-parts":[["2007"]]},"source":"Semantic Scholar","title":"Long-time-average-spectra applied to analysis of music","type":"paper-conference","URL":"https://www.semanticscholar.org/paper/Long-time-average-spectra-applied-to-analysis-of-Jansson/71befcd4282e07f079db20b2b33e160b33dfcd0c"},
  {"id":"johnson","abstract":"A primary goal of predictive modeling is to find a reliable and effective predic- tive relationship between an available set of features and an outcome. This book provides an extensive set of techniques for uncovering effective representations of the features for modeling the outcome and for finding an optimal subset of features to improve a model’s predictive performance.","accessed":{"date-parts":[["2023",11,13]]},"author":[{"family":"Johnson","given":"Max Kuhn and Kjell"}],"citation-key":"johnson","source":"www.feat.engineering","title":"Feature Engineering and Selection: A Practical Approach for Predictive Models","title-short":"Feature Engineering and Selection","type":"book","URL":"http://www.feat.engineering/"},
  {"id":"juniordataguyakl2020","accessed":{"date-parts":[["2024",9,22]]},"author":[{"family":"JuniorDataGuyAKL","given":""}],"citation-key":"juniordataguyakl2020","container-title":"Data Science Stack Exchange","genre":"Forum post","issued":{"date-parts":[["2020",5,19]]},"title":"How to understand ANOVA-F for feature selection in Python. Sklearn SelectKBest with f_classif","type":"post","URL":"https://datascience.stackexchange.com/q/74465"},
  {"id":"krall2023","accessed":{"date-parts":[["2024",9,22]]},"author":[{"family":"Krall","given":"Eugene"}],"citation-key":"krall2023","container-title":"Cross Validated","issued":{"date-parts":[["2023",11,15]]},"title":"Answer to \"How can I explain the intuition behind ANOVA?\"","title-short":"Answer to \"How can I explain the intuition behind ANOVA?","type":"post","URL":"https://stats.stackexchange.com/a/631387"},
  {"id":"l2016","accessed":{"date-parts":[["2023",12,4]]},"author":[{"family":"L","given":"Matt"}],"citation-key":"l2016","container-title":"Signal Processing Stack Exchange","issued":{"date-parts":[["2016",7,20]]},"title":"Answer to \"What should be the correct scaling for PSD calculation using $\\tt fft$\"","type":"post","URL":"https://dsp.stackexchange.com/a/32206/62413"},
  {"id":"larsen","author":[{"family":"Larsen","given":"Richard J"},{"family":"Marx","given":"Morris L"}],"citation-key":"larsen","language":"en","source":"Zotero","title":"AN INTRODUCTION TO MATHEMATICAL STATISTICS AND ITS APPLICATIONS","type":"article-journal"},
  {"id":"li2024","abstract":"Self-supervised learning (SSL) has recently emerged as a promising paradigm for training generalisable models on large-scale data in the fields of vision, text, and speech. Although SSL has been proven effective in speech and audio, its application to music audio has yet to be thoroughly explored. This is partially due to the distinctive challenges associated with modelling musical knowledge, particularly tonal and pitched characteristics of music. To address this research gap, we propose an acoustic Music undERstanding model with large-scale self-supervised Training (MERT), which incorporates teacher models to provide pseudo labels in the masked language modelling (MLM) style acoustic pre-training. In our exploration, we identified an effective combination of teacher models, which outperforms conventional speech and audio approaches in terms of performance. This combination includes an acoustic teacher based on Residual Vector Quantisation - Variational AutoEncoder (RVQ-VAE) and a musical teacher based on the Constant-Q Transform (CQT). Furthermore, we explore a wide range of settings to overcome the instability in acoustic language model pre-training, which allows our designed paradigm to scale from 95M to 330M parameters. Experimental results indicate that our model can generalise and perform well on 14 music understanding tasks and attain state-of-the-art (SOTA) overall scores.","accessed":{"date-parts":[["2024",5,2]]},"author":[{"family":"Li","given":"Yizhi"},{"family":"Yuan","given":"Ruibin"},{"family":"Zhang","given":"Ge"},{"family":"Ma","given":"Yinghao"},{"family":"Chen","given":"Xingran"},{"family":"Yin","given":"Hanzhi"},{"family":"Xiao","given":"Chenghao"},{"family":"Lin","given":"Chenghua"},{"family":"Ragni","given":"Anton"},{"family":"Benetos","given":"Emmanouil"},{"family":"Gyenge","given":"Norbert"},{"family":"Dannenberg","given":"Roger"},{"family":"Liu","given":"Ruibo"},{"family":"Chen","given":"Wenhu"},{"family":"Xia","given":"Gus"},{"family":"Shi","given":"Yemin"},{"family":"Huang","given":"Wenhao"},{"family":"Wang","given":"Zili"},{"family":"Guo","given":"Yike"},{"family":"Fu","given":"Jie"}],"citation-key":"li2024","DOI":"10.48550/arXiv.2306.00107","issued":{"date-parts":[["2024",4,22]]},"number":"arXiv:2306.00107","publisher":"arXiv","source":"arXiv.org","title":"MERT: Acoustic Music Understanding Model with Large-Scale Self-supervised Training","title-short":"MERT","type":"article","URL":"http://arxiv.org/abs/2306.00107"},
  {"id":"lukasik2003","author":[{"family":"Lukasik","given":"Ewa"}],"citation-key":"lukasik2003","issued":{"date-parts":[["2003",1,1]]},"source":"ResearchGate","title":"AMATI - Multimedia Database of Violin Sounds","type":"paper-conference"},
  {"id":"lukasik2009","abstract":"Cepstral coefficients in mel scale proved to be efficient features for speaker and musical instrument recognition. In this paper Long Term Cepstral Coefficients – LTCCs – of solo musical phrases are used as features for identification of individual violins. LTCC represents the envelope of LTAS – Long Term Average Spectrum in linear scale useful to characterize the subtleties’ of violin sound in frequency domain. Results of the classification of 60 instruments are presented and discussed. It was shown, that if the experts’ knowledge is applied to analyze violin sound, the results may be promising.","author":[{"family":"Lukasik","given":"Ewa"}],"citation-key":"lukasik2009","issued":{"date-parts":[["2009"]]},"language":"en","source":"Zotero","title":"Long Term Cepstral Coefficients for violin identification","type":"article-journal"},
  {"id":"lukasik2010","abstract":"Cepstral coefficients in mel scale proved to be efficient features for speaker and musical instrument recognition. In this paper Long Term Cepstral Coefficients  LTCCs  of solo musical phrases are used as features for identification of individual violins. LTCC represents the envelope of LTAS  Long Term Average Spectrum in linear scale useful to characterize the subtleties of violin sound in frequency domain. Results of the classification of 60 instruments are presented and discussed. It was shown, that if the experts knowledge is applied to analyze violin sound, the results may be promising.","accessed":{"date-parts":[["2024",4,24]]},"author":[{"family":"Lukasik","given":"E."}],"citation-key":"lukasik2010","container-title":"Journal of The Audio Engineering Society","issued":{"date-parts":[["2010",5,1]]},"source":"Semantic Scholar","title":"Long Term Cepstral Coefficients for Violin Identification","type":"article-journal","URL":"https://www.semanticscholar.org/paper/Long-Term-Cepstral-Coefficients-for-Violin-Lukasik/1078124310e55d7f734e2cead68f0d1ad7ccf511"},
  {"id":"magalhaes2020","abstract":"Iracema is a Python library that aims to provide models for the extraction of meaningful informationfrom recordings of monophonic pieces of music, for purposes of research in music performance. With this objective in mind, we propose an architecture that will provide to users an abstraction level that simplifies the manipulation of different kinds of time series, as well as the extraction of segments from them. In this paper we: (1) introduce some key concepts at the core of the proposed architecture; (2) describe the current functionalities of the package; (3) give some examples of the application programming interface; and (4) give some brief examples of audio analysis using the system.","author":[{"family":"Magalhaes","given":"Tairone"},{"family":"Barros","given":"Felippe"},{"family":"Loureiro","given":"Mauricio"}],"citation-key":"magalhaes2020","container-title":"Revista de Informática Teórica e Aplicada","container-title-short":"Revista de Informática Teórica e Aplicada","DOI":"10.22456/2175-2745.107202","issued":{"date-parts":[["2020",12,23]]},"page":"127-138","source":"ResearchGate","title":"Iracema: a Python library for audio content analysis","title-short":"Iracema","type":"article-journal","volume":"27"},
  {"id":"malvermi2022","abstract":"Comparing violins requires competence and involves both subjective and objective evaluations. In this manuscript, vibration tests were performed on a set of 25 violins, both historical and new. The resulting bridge admittances were modeled in the low and mid-frequency ranges through a set of objective features. Once projected into the new representation, the bridge admittances of three historical violins made by Stradivari and a famous reproduction revealed high similarity. PCA highlighted the importance of signature mode frequencies, bridge hill behavior, and signature mode amplitudes in distinguishing different violins.","accessed":{"date-parts":[["2024",9,24]]},"author":[{"family":"Malvermi","given":"Raffaele"},{"family":"Gonzalez","given":"Sebastian"},{"family":"Antonacci","given":"Fabio"},{"family":"Sarti","given":"Augusto"},{"family":"Corradi","given":"Roberto"}],"citation-key":"malvermi2022","container-title":"Applied Sciences","DOI":"10.3390/app12147313","ISSN":"2076-3417","issue":"14","issued":{"date-parts":[["2022",1]]},"language":"en","license":"http://creativecommons.org/licenses/by/3.0/","number":"14","page":"7313","publisher":"Multidisciplinary Digital Publishing Institute","source":"www.mdpi.com","title":"A Statistical Approach to Violin Evaluation","type":"article-journal","URL":"https://www.mdpi.com/2076-3417/12/14/7313","volume":"12"},
  {"id":"manshaei2020","accessed":{"date-parts":[["2024",9,22]]},"author":[{"family":"Manshaei","given":"Kasra"}],"citation-key":"manshaei2020","container-title":"Data Science Stack Exchange","issued":{"date-parts":[["2020",5,19]]},"title":"Answer to \"How to understand ANOVA-F for feature selection in Python. Sklearn SelectKBest with f_classif\"","type":"post","URL":"https://datascience.stackexchange.com/a/74486"},
  {"id":"martin1998","abstract":"A statistical pattern-recognition technique was applied to the classification of musical instrument tones within a taxonomic hierarchy. Perceptually salient acoustic features—related to the physical properties of source excitation and resonance structure—were measured from the output of an auditory model (the log-lag correlogram) for 1023 isolated tones over the full pitch ranges of 15 orchestral instruments. The data set included examples from the string (bowed and plucked), woodwind (single, double, and air reed), and brass families. Using 70%/30% splits between training and test data, maximum a posteriori classifiers were constructed based on Gaussian models arrived at through Fisher multiple-discriminant analysis. The classifiers distinguished transient from continuant tones with approximately 99% correct performance. Instrument families were identified with approximately 90% performance, and individual instruments were identified with an overall success rate of approximately 70%. These preliminary analyses compare favorably with human performance on the same task and demonstrate the utility of the hierarchical approach to classification.","accessed":{"date-parts":[["2024",5,7]]},"author":[{"family":"Martin","given":"Keith D."},{"family":"Kim","given":"Youngmoo E."}],"citation-key":"martin1998","container-title":"The Journal of the Acoustical Society of America","DOI":"10.1121/1.424083","ISSN":"0001-4966, 1520-8524","issue":"3_Supplement","issued":{"date-parts":[["1998",9,1]]},"language":"en","page":"1768-1768","source":"Semantic Scholar","title":"Musical instrument identification: A pattern-recognition approach","title-short":"Musical instrument identification","type":"article-journal","URL":"https://pubs.aip.org/jasa/article/104/3_Supplement/1768/558739/Musical-instrument-identification-A-pattern","volume":"104"},
  {"id":"mclennan2017","abstract":"This book dispels the mystery that the position of the sound post in determining the sound quality of the violin is critical. Placed outside the treble foot of the bridge, it lifts the output of the lower strings, making the sound even across the range and optimizes the \"breathing action\" of the violin body for sound radiation.","author":[{"family":"McLennan","given":"John E."}],"citation-key":"mclennan2017","ISBN":"978-1-5434-0310-7","issued":{"date-parts":[["2017"]]},"language":"en","number-of-pages":"134","publisher":"Xlibris","source":"Google Books","title":"The Soundpost in the Violin","type":"book"},
  {"id":"moes","author":[{"family":"Moës","given":"Nicolas"}],"citation-key":"moes","language":"fr","source":"Zotero","title":"Mécanique des milieux continus","type":"article-journal"},
  {"id":"moore1995","abstract":"Hearing is a comprehensive, authoritative reference work covering both the physiological and perceptual aspects of hearing. Intended for researchers and advanced students in the field of hearing, it reviews major areas of research in addition to new discoveries, including active mechanisms in the cochlea, across-channel processes in auditory masking, and perceptual grouping processes.Covers both physiological and perceptual aspects of hearingAuthoritative reviews by experts in the fieldComprehensive up-to-date coverageAn integrated work with extensive cross-references between chapters","citation-key":"moore1995","edition":"1st edition","editor":[{"family":"Moore","given":"Brian C. J."}],"event-place":"San Diego","ISBN":"978-0-12-505626-7","issued":{"date-parts":[["1995",9,11]]},"language":"English","number-of-pages":"468","publisher":"Academic Press","publisher-place":"San Diego","source":"Amazon","title":"Hearing","type":"book"},
  {"id":"moral2007","abstract":"Long-Time-Average-Spectra, LTAS:es, have proved to give representative records of violins. The fulltime scales recorded in a reverberation chamber have, however, not been well suited for listening tests. Therefore in this investigation the recordings were made in an anechoic chamber and the effects on the LTAS by reducing the number of tones played were tried. Furthermore, the relations were investigated between Single-Tone -Spectra, STS :es, and LTAS:es. The investigations show that a representative LTAS of a violin can be obtained from every third tone on the two middle strings. Furthermore, i t shows that the spectrum level of all strings a r e approximately equal to 12 Bark and thereafter it drops 4 dB from a string to the next lower and that the high frequency limit of each string drops one Bark from one string to the next lower string. The levels of the STS:es fall in general within f 5 dB of the LTAS of the same string.","accessed":{"date-parts":[["2024",7,15]]},"author":[{"family":"Moral","given":"A."}],"citation-key":"moral2007","issued":{"date-parts":[["2007"]]},"source":"Semantic Scholar","title":"Long-time-average-spectra of scales and spectra of single tones from a violin","type":"paper-conference","URL":"https://www.semanticscholar.org/paper/Long-time-average-spectra-of-scales-and-spectra-of-Moral/a3ae4ee2b9a853d368e9e39f9108a9b40c37e017"},
  {"id":"muckenhirn2017","abstract":"Automatic speaker veriﬁcation systems can be spoofed through recorded, synthetic or voice converted speech of target speakers. To make these systems practically viable, the detection of such attacks, referred to as presentation attacks, is of paramount interest. In that direction, this paper investigates two aspects: (a) a novel approach to detect presentation attacks where, unlike conventional approaches, no speech signal modeling related assumptions are made, rather the attacks are detected by computing ﬁrst order and second order spectral statistics and feeding them to a classiﬁer, and (b) generalization of the presentation attack detection systems across databases. Our investigations on ASVspoof 2015 challenge database and AVspoof database show that, when compared to the approaches based on conventional short-term spectral features, the proposed approach with a linear discriminative classiﬁer yields a better system, irrespective of whether the spoofed signal is replayed to the microphone or is directly injected into the system software process. Cross-database investigations show that neither the short-term spectral processing based approaches nor the proposed approach yield systems which are able to generalize across databases or methods of attack. Thus, revealing the difﬁculty of the problem and the need for further resources and research.","accessed":{"date-parts":[["2024",8,30]]},"author":[{"family":"Muckenhirn","given":"Hannah"},{"family":"Korshunov","given":"Pavel"},{"family":"Magimai-Doss","given":"Mathew"},{"family":"Marcel","given":"Sebastien"}],"citation-key":"muckenhirn2017","container-title":"IEEE/ACM Transactions on Audio, Speech, and Language Processing","container-title-short":"IEEE/ACM Trans. Audio Speech Lang. Process.","DOI":"10.1109/TASLP.2017.2743340","ISSN":"2329-9290, 2329-9304","issue":"11","issued":{"date-parts":[["2017",11]]},"language":"en","license":"https://ieeexplore.ieee.org/Xplorehelp/downloads/license-information/IEEE.html","page":"2098-2111","source":"DOI.org (Crossref)","title":"Long-Term Spectral Statistics for Voice Presentation Attack Detection","type":"article-journal","URL":"http://ieeexplore.ieee.org/document/8015145/","volume":"25"},
  {"id":"navarro","author":[{"family":"Navarro","given":"Daniel"}],"citation-key":"navarro","language":"en","source":"Zotero","title":"Learning Statistics with R","type":"article-journal"},
  {"id":"osorio","abstract":"The complexity and subjectivity of the judgement task conceals the existence of biases that undermines the quality of the process. This paper presents a weighted aggregation function that attempts to reduce the inﬂuence of biased judgements on the ﬁnal score. We also discuss a set of desirable properties. The proposed weighted aggregation function is able to correct the “nationalism bias”found by Emerson et al. (2009) in the 2000 Olympic Games diving competition and suggest the possibility of a “reputation bias”. Our results can be applied to judgement sports and other activities that require the aggregation of several personal evaluations.","author":[{"family":"Osorio","given":"Antonio"}],"citation-key":"osorio","language":"en","source":"Zotero","title":"Judgement and Ranking: Living with Hidden Bias","type":"article-journal"},
  {"id":"p2022","accessed":{"date-parts":[["2023",11,28]]},"author":[{"family":"P","given":"Arathi"}],"citation-key":"p2022","container-title":"Signal Processing Stack Exchange","genre":"Forum post","issued":{"date-parts":[["2022",1,6]]},"title":"about PSD scailing factor","type":"post","URL":"https://dsp.stackexchange.com/q/80805"},
  {"id":"pedregosa2011","abstract":"Scikit-learn is a Python module integrating a wide range of state-of-the-art machine learning algorithms for medium-scale supervised and unsupervised problems. This package focuses on bringing machine learning to non-specialists using a general-purpose high-level language. Emphasis is put on ease of use, performance, documentation, and API consistency. It has minimal dependencies and is distributed under the simplified BSD license, encouraging its use in both academic and commercial settings. Source code, binaries, and documentation can be downloaded from http://scikit-learn.sourceforge.net.","accessed":{"date-parts":[["2024",9,28]]},"author":[{"family":"Pedregosa","given":"Fabian"},{"family":"Varoquaux","given":"Gaël"},{"family":"Gramfort","given":"Alexandre"},{"family":"Michel","given":"Vincent"},{"family":"Thirion","given":"Bertrand"},{"family":"Grisel","given":"Olivier"},{"family":"Blondel","given":"Mathieu"},{"family":"Prettenhofer","given":"Peter"},{"family":"Weiss","given":"Ron"},{"family":"Dubourg","given":"Vincent"},{"family":"Vanderplas","given":"Jake"},{"family":"Passos","given":"Alexandre"},{"family":"Cournapeau","given":"David"},{"family":"Brucher","given":"Matthieu"},{"family":"Perrot","given":"Matthieu"},{"family":"Duchesnay","given":"Édouard"}],"citation-key":"pedregosa2011","container-title":"Journal of Machine Learning Research","ISSN":"1533-7928","issue":"85","issued":{"date-parts":[["2011"]]},"page":"2825-2830","source":"www.jmlr.org","title":"Scikit-learn: Machine Learning in Python","title-short":"Scikit-learn","type":"article-journal","URL":"http://jmlr.org/papers/v12/pedregosa11a.html","volume":"12"},
  {"id":"peeters2004","author":[{"family":"Peeters","given":"Geoffroy"}],"citation-key":"peeters2004","issued":{"date-parts":[["2004",1,1]]},"source":"ResearchGate","title":"A large set of audio features for sound description (similarity and classification) in the CUIDADO project","type":"article-journal"},
  {"id":"peeters2011","abstract":"The analysis of musical signals to extract audio descriptors that can potentially characterize their timbre has been disparate and often too focused on a particular small set of sounds. The Timbre Toolbox provides a comprehensive set of descriptors that can be useful in perceptual research, as well as in music information retrieval and machine-learning approaches to content-based retrieval in large sound databases. Sound events are first analyzed in terms of various input representations (short-term Fourier transform, harmonic sinusoidal components, an auditory model based on the equivalent rectangular bandwidth concept, the energy envelope). A large number of audio descriptors are then derived from each of these representations to capture temporal, spectral, spectrotemporal, and energetic properties of the sound events. Some descriptors are global, providing a single value for the whole sound event, whereas others are time-varying. Robust descriptive statistics are used to characterize the time-varying descriptors. To examine the information redundancy across audio descriptors, correlational analysis followed by hierarchical clustering is performed. This analysis suggests ten classes of relatively independent audio descriptors, showing that the Timbre Toolbox is a multidimensional instrument for the measurement of the acoustical structure of complex sound signals.","accessed":{"date-parts":[["2023",10,31]]},"author":[{"family":"Peeters","given":"Geoffroy"},{"family":"Giordano","given":"Bruno L."},{"family":"Susini","given":"Patrick"},{"family":"Misdariis","given":"Nicolas"},{"family":"McAdams","given":"Stephen"}],"citation-key":"peeters2011","container-title":"The Journal of the Acoustical Society of America","container-title-short":"The Journal of the Acoustical Society of America","DOI":"10.1121/1.3642604","ISSN":"0001-4966","issue":"5","issued":{"date-parts":[["2011",11,16]]},"page":"2902-2916","source":"Silverchair","title":"The Timbre Toolbox: Extracting audio descriptors from musical signals","title-short":"The Timbre Toolbox","type":"article-journal","URL":"https://doi.org/10.1121/1.3642604","volume":"130"},
  {"id":"petiot2023","abstract":"Sound simulations by physical modelling are interesting to transcribe the physics underlying the functioning of a musical instrument. These simulations make it possible to listen to a virtual instrument with a mode of operation representative of the musician-instrument interaction. The work consists of studying the contribution of machine learning (ML) methods in the understanding of the relationships between the shape of a trumpet and the sound simulated. The physical model used is based on an acoustical modeling of the resonator, a mechanical model of the excitator, and an aeroelastic coupling between the excitator and the resonator. From different samples of the input impedance of the resonator, time domain simulations are generated to constitute a training set of sounds. Supervised learning is next trained to the data, with the impedance as input and sound descriptors as outputs, using classical ML methods (neural networks). The ML model is finally used to optimize the sound descriptors levels, according to the input impedance. To illustrate the approach, different \"targets\" for the sound features are considered (brightness, intonation), and a validation is conducted with the simulations. The approach is a first stage toward a \"customization\" of an instrument according to different perceptual dimensions.","accessed":{"date-parts":[["2024",1,11]]},"author":[{"family":"Petiot","given":"Jean-François"},{"family":"Roatta","given":"Misael"},{"family":"Fréour","given":"Vincent"},{"family":"Arimoto","given":"Keita"}],"citation-key":"petiot2023","event-title":"Forum Acusticum 2023","issued":{"date-parts":[["2023",9,11]]},"language":"en","source":"theses.hal.science","title":"CONTRIBUTION OF MACHINE LEARNING AND PHYSICS-BASED SOUND SIMULATIONS FOR THE CHARACTERIZATION OF BRASS INSTRUMENTS","type":"paper-conference","URL":"https://hal.science/hal-04342950"},
  {"id":"rogers2017","call-number":"QP435 .D53 2017","citation-key":"rogers2017","collection-title":"Woodhead publishing series in food science, technology and nutrition","editor":[{"family":"Rogers","given":"Lauren"}],"event-place":"Duxford","ISBN":"978-0-08-101009-9 978-0-08-101116-4","issued":{"date-parts":[["2017"]]},"language":"en","note":"OCLC: on1008602402","number-of-pages":"500","publisher":"Elsevier/Woodhead Publishing","publisher-place":"Duxford","source":"Library of Congress ISBN","title":"Discrimination testing in sensory science: a practical handbook","title-short":"Discrimination testing in sensory science","type":"book"},
  {"id":"rougier","author":[{"family":"Rougier","given":"Nicolas P"}],"citation-key":"rougier","language":"en","source":"Zotero","title":"Scientific Visualization: Python  Matplotlib","type":"article-journal"},
  {"id":"rougiera","author":[{"family":"Rougier","given":"Nicolas P"}],"citation-key":"rougiera","language":"en","source":"Zotero","title":"Scientific Visualization: Python + Matplotlib","type":"article-journal"},
  {"id":"roussel","author":[{"family":"Roussel","given":"Jimmy"}],"citation-key":"roussel","language":"fr","source":"Zotero","title":"Cours de mécanique classique – femto-physique.fr","type":"article-journal"},
  {"id":"saitis2019","abstract":"Results from a previous study on the perceptual evaluation of violins that involved playing-based semantic ratings showed that preference for a violin was strongly associated with its perceived sound richness. However, both preference and richness ratings varied widely between individual violinists, likely because musicians conceptualize the same attribute in different ways. To better understand how richness is conceptualized by violinists and how it contributes to the perceived quality of a violin, we analyzed free verbal descriptions collected during a carefully controlled playing task (involving 16 violinists) and in an online survey where no sound examples or other contextual information was present (involving 34 violinists). The analysis was based on a psycholinguistic method, whereby semantic categories are inferred from the verbal data itself through syntactic context and linguistic markers. The main sensory property related to violin sound richness was expressed through words such as full, complex, and dense versus thin and small, referring to the perceived number of partials present in the sound. Another sensory property was expressed through words such as warm, velvety, and smooth versus strident, harsh, and tinny, alluding to spectral energy distribution cues. Haptic cues were also implicated in the conceptualization of violin sound richness.","author":[{"family":"Saitis","given":"Charalampos"},{"family":"Fritz","given":"Claudia"},{"family":"Scavone","given":"Gary"}],"citation-key":"saitis2019","issued":{"date-parts":[["2019"]]},"language":"en","source":"Zotero","title":"Sounds like melted chocolate: How musicians conceptualize violin sound richness","type":"article-journal"},
  {"id":"scheirer1997","abstract":"We report on the construction of a real-time computer system capable of distinguishing speech signals from music signals over a wide range of digital audio input. We have examined 13 features intended to measure conceptually distinct properties of speech and/or music signals, and combined them in several multidimensional classiﬁcation frameworks. We provide extensive data on system performance and the cross-validated training/test setup used to evaluate the system. For the datasets currently in use, the best classiﬁer classiﬁes with 5.8% error on a frame-by-frame basis, and 1.4% error when integrating long (2.4 second) segments of sound.","accessed":{"date-parts":[["2023",11,9]]},"author":[{"family":"Scheirer","given":"E."},{"family":"Slaney","given":"M."}],"citation-key":"scheirer1997","container-title":"1997 IEEE International Conference on Acoustics, Speech, and Signal Processing","DOI":"10.1109/ICASSP.1997.596192","event-place":"Munich, Germany","event-title":"1997 IEEE International Conference on Acoustics, Speech, and Signal Processing","ISBN":"978-0-8186-7919-3","issued":{"date-parts":[["1997"]]},"language":"en","page":"1331-1334","publisher":"IEEE Comput. Soc. Press","publisher-place":"Munich, Germany","source":"DOI.org (Crossref)","title":"Construction and evaluation of a robust multifeature speech/music discriminator","type":"paper-conference","URL":"http://ieeexplore.ieee.org/document/596192/","volume":"2"},
  {"id":"scholl","author":[{"family":"Scholl","given":"Stefan"}],"citation-key":"scholl","language":"en","source":"Zotero","title":"Exact Signal Measurements using FFT Analysis","type":"article-journal"},
  {"id":"schoonderwaldt2009","accessed":{"date-parts":[["2023",10,17]]},"author":[{"family":"Schoonderwaldt","given":"Erwin"}],"citation-key":"schoonderwaldt2009","container-title":"Acta Acustica united with Acustica","container-title-short":"Acta Acustica united with Acustica","DOI":"10.3813/AAA.918221","ISSN":"16101928","issue":"5","issued":{"date-parts":[["2009",9,1]]},"language":"en","page":"901-914","source":"DOI.org (Crossref)","title":"The Violinist's Sound Palette: Spectral Centroid, Pitch Flattening and Anomalous Low Frequencies","title-short":"The Violinist's Sound Palette","type":"article-journal","URL":"http://openurl.ingenta.com/content/xref?genre=article&issn=1610-1928&volume=95&issue=5&spage=901","volume":"95"},
  {"id":"setragno2017","abstract":"Timbral quality of historical violins has been discussed for years. In this paper, we show that it is possible to characterize it from an objective, low-level features perspective. Feature selection algorithms are used to select the features that most characterize historical and contemporary violins. The feature representation of violins is then reduced by means of the T-SNE method. In the low-dimensional space which is obtained, historical violins tend to group together.","accessed":{"date-parts":[["2023",10,25]]},"author":[{"family":"Setragno","given":"Francesco"},{"family":"Zanoni","given":"Massimiliano"},{"family":"Sarti","given":"Augusto"},{"family":"Antonacci","given":"Fabio"}],"citation-key":"setragno2017","container-title":"2017 25th European Signal Processing Conference (EUSIPCO)","DOI":"10.23919/EUSIPCO.2017.8081530","event-place":"Kos, Greece","event-title":"2017 25th European Signal Processing Conference (EUSIPCO)","ISBN":"978-0-9928626-7-1","issued":{"date-parts":[["2017",8]]},"language":"en","page":"1853-1857","publisher":"IEEE","publisher-place":"Kos, Greece","source":"DOI.org (Crossref)","title":"Feature-based characterization of violin timbre","type":"paper-conference","URL":"http://ieeexplore.ieee.org/document/8081530/"},
  {"id":"setragno2017a","abstract":"Violin timbre is a very complex case of study. The sound properties that distinguish an historical violin from a modern one are still not clear. The purpose of this study is to understand what are these properties, by means of feature-based analysis. We extract audio features related to timbre and we exploit feature selection techniques in order to investigate what are the most characterizing ones. We compare different feature selection algorithms and we illustrate how we applied their outcome to a classification task with historical and modern instruments. Results show that the classification performance improves when using the selected features.","accessed":{"date-parts":[["2024",4,24]]},"author":[{"family":"Setragno","given":"F."},{"family":"Zanoni","given":"M."},{"family":"Antonacci","given":"F."},{"family":"Sarti","given":"A."}],"citation-key":"setragno2017a","issued":{"date-parts":[["2017"]]},"source":"Semantic Scholar","title":"Feature-Based Timbral Characterization of Historical and Modern Violins","type":"paper-conference","URL":"https://www.semanticscholar.org/paper/Feature-Based-Timbral-Characterization-of-and-Setragno-Zanoni/84971ffe04917aada0de142400b5333ed01f5f95"},
  {"id":"shao2003","accessed":{"date-parts":[["2023",12,18]]},"author":[{"family":"Shao","given":"Jun"}],"citation-key":"shao2003","collection-editor":[{"family":"Casella","given":"G."},{"family":"Fienberg","given":"S."},{"family":"Olkin","given":"I."}],"collection-title":"Springer Texts in Statistics","DOI":"10.1007/b97553","event-place":"New York, NY","ISBN":"978-0-387-95382-3 978-0-387-21718-5","issued":{"date-parts":[["2003"]]},"publisher":"Springer","publisher-place":"New York, NY","source":"DOI.org (Crossref)","title":"Mathematical Statistics","type":"book","URL":"http://link.springer.com/10.1007/b97553"},
  {"id":"siedenburg2019","accessed":{"date-parts":[["2023",10,25]]},"citation-key":"siedenburg2019","collection-title":"Springer Handbook of Auditory Research","DOI":"10.1007/978-3-030-14832-4","editor":[{"family":"Siedenburg","given":"Kai"},{"family":"Saitis","given":"Charalampos"},{"family":"McAdams","given":"Stephen"},{"family":"Popper","given":"Arthur N."},{"family":"Fay","given":"Richard R."}],"event-place":"Cham","ISBN":"978-3-030-14831-7 978-3-030-14832-4","issued":{"date-parts":[["2019"]]},"language":"en","publisher":"Springer International Publishing","publisher-place":"Cham","source":"DOI.org (Crossref)","title":"Timbre: Acoustics, Perception, and Cognition","title-short":"Timbre","type":"book","URL":"http://link.springer.com/10.1007/978-3-030-14832-4","volume":"69"},
  {"id":"sinha2021","accessed":{"date-parts":[["2024",9,22]]},"author":[{"family":"Sinha","given":"Prateek"}],"citation-key":"sinha2021","container-title":"Data Science Stack Exchange","issued":{"date-parts":[["2021",5,6]]},"title":"Answer to \"How to understand ANOVA-F for feature selection in Python. Sklearn SelectKBest with f_classif\"","type":"post","URL":"https://datascience.stackexchange.com/a/94090"},
  {"id":"stanczyk2015","abstract":"This research book provides the reader with a selection of high-quality texts dedicated to current progress, new developments and research trends in feature selection for data and pattern recognition. Even though it has been the subject of interest for some time, feature selection remains one of actively pursued avenues of investigations due to its importance and bearing upon other problems and tasks. This volume points to a number of advances topically subdivided into four parts: estimation of importance of characteristic features, their relevance, dependencies, weighting and ranking; rough set approach to attribute reduction with focus on relative reducts; construction of rules and their evaluation; and data- and domain-oriented methodologies.","author":[{"family":"Stańczyk","given":""}],"citation-key":"stanczyk2015","edition":"2015th edition","event-place":"Heidelberg Berlin","ISBN":"978-3-662-45619-4","issued":{"date-parts":[["2015",1,15]]},"language":"English","number-of-pages":"376","publisher":"Springer","publisher-place":"Heidelberg Berlin","source":"Amazon","title":"Feature Selection for Data and Pattern Recognition","type":"book"},
  {"id":"stats_student2019","accessed":{"date-parts":[["2024",9,22]]},"author":[{"family":"stats_student","given":""}],"citation-key":"stats_student2019","container-title":"Cross Validated","genre":"Forum post","issued":{"date-parts":[["2019",1,4]]},"title":"How can I explain the intuition behind ANOVA?","type":"post","URL":"https://stats.stackexchange.com/q/40549"},
  {"id":"stepanek2006","abstract":"Two approaches to the study of musical sound timbre are described and documented by psychoacoustic experiment examples. The classical bottom-up approach is demonstrated on the study of contexts of violin sounds and pipe organ sounds. Verbal attributes collected during listening tests were used for the interpretation and comparison of resulted perceptual spaces of sounds.","author":[{"family":"Stepanek","given":"Jan"}],"citation-key":"stepanek2006","issued":{"date-parts":[["2006"]]},"language":"en","source":"Zotero","title":"Musical Sound Timbre: Verbal Description and Dimensions","type":"article-journal"},
  {"id":"taylor2005","author":[{"family":"Taylor","given":"John R."}],"citation-key":"taylor2005","edition":"Nachdr.","event-place":"Sausalito, Calif","ISBN":"978-1-891389-22-1","issued":{"date-parts":[["2005"]]},"language":"eng","number-of-pages":"786","publisher":"University Science Books","publisher-place":"Sausalito, Calif","source":"K10plus ISBN","title":"Classical mechanics","type":"book"},
  {"id":"turckheim","abstract":"In this paper, a semi-virtual violin is presented which has been developed in the context of a research project on desirable violin sound properties. The method used here focuses on musicians' perception of spectral components rather than on physical modeling properties. A silent violin which has been designed with particular emphasis on authentic haptic and visual properties is used as interface between musician and virtual body. Binaural transfer functions of real violins measured at the violinist's hearing position serve as initial sound references for further spectral modifications. A filtering software enables highly-detailed modifications in the frequency domain, changing individual resonances or resonance areas while leaving other resonances unaffected. Implementation on an external signal processor provides for real-time sound processing. An application example demonstrates the tools capability: The presented tool can be used, inter alia, to manipulate the vowel quality in violin tones by modifying specific formant properties.","author":[{"family":"Türckheim","given":"Friedrich"},{"family":"Smit","given":"Thorsten"},{"family":"Mores","given":"Robert"}],"citation-key":"turckheim","source":"ResearchGate","title":"The Semi-Virtual Violin – A Perception Tool","type":"article-journal"},
  {"id":"turckheim2010","abstract":"This paper introduces a measurement technique which delivers highly reproducible impulse responses of stringed instruments. The method bases on exciting the dampened strings at the bowing or plucking position by means of a thin copper wire which is pulled until it breaks. Taking into account the longitudinal and torsional movements of a bridge caused by string deﬂection, such stimulus of an instrument is close to the musical application. On the basis of the string-wire geometry, measurement setups can be exactly speciﬁed and individually adjusted, allowing for highly accurate repetition in comparative studies. The setup, including a fully automated exciting apparatus as well as a ’silent’ quadrochord, is described in detail. Furthermore, the method is compared with the commonly used impact hammer method. Finally, an application in the context of a research project on violin sound quality is brieﬂy described, where the technique is used to measure binaural impulse responses of violins.","author":[{"family":"Türckheim","given":"Friedrich"},{"family":"Smit","given":"Thorsten"},{"family":"Hahne","given":"Carolin"},{"family":"Mores","given":"Robert"}],"citation-key":"turckheim2010","issued":{"date-parts":[["2010"]]},"language":"en","source":"Zotero","title":"Novel Impulse Response Measurement Method for Stringed Instruments","type":"article-journal"},
  {"id":"wang2020","abstract":"Individual recognition among instruments of the same type is a challenging problem and it has been rarely investigated. In this study, the individual recognition of violins is explored. Based on the source–filter model, the spectrum can be divided into tonal content and nontonal content, which reflects the timbre from complementary aspects. The tonal/nontonal gammatone frequency cepstral coefficients (GFCC) are combined to describe the corresponding spectrum contents in this study. In the recognition system, Gaussian mixture models–universal background model (GMM–UBM) is employed to parameterize the distribution of the combined features. In order to evaluate the recognition task of violin individuals, a solo dataset including 86 violins is developed in this study. Compared with other features, the combined features show a better performance in both individual violin recognition and violin grade classification. Experimental results also show the GMM–UBM outperforms the CNN, especially when the training data are limited. Finally, the effect of players on the individual violin recognition is investigated.","accessed":{"date-parts":[["2023",10,16]]},"author":[{"family":"Wang","given":"Qi"},{"family":"Bao","given":"Changchun"}],"citation-key":"wang2020","container-title":"Electronics","DOI":"10.3390/electronics9060950","ISSN":"2079-9292","issue":"6","issued":{"date-parts":[["2020",6]]},"language":"en","license":"http://creativecommons.org/licenses/by/3.0/","number":"6","page":"950","publisher":"Multidisciplinary Digital Publishing Institute","source":"www.mdpi.com","title":"Individual Violin Recognition Method Combining Tonal and Nontonal Features","type":"article-journal","URL":"https://www.mdpi.com/2079-9292/9/6/950","volume":"9"},
  {"id":"wang2020a","abstract":"Individual recognition among instruments of the same type is a challenging problem and it has been rarely investigated. In this study, the individual recognition of violins is explored. Based on the source–filter model, the spectrum can be divided into tonal content and nontonal content, which reflects the timbre from complementary aspects. The tonal/nontonal gammatone frequency cepstral coefficients (GFCC) are combined to describe the corresponding spectrum contents in this study. In the recognition system, Gaussian mixture models–universal background model (GMM–UBM) is employed to parameterize the distribution of the combined features. In order to evaluate the recognition task of violin individuals, a solo dataset including 86 violins is developed in this study. Compared with other features, the combined features show a better performance in both individual violin recognition and violin grade classification. Experimental results also show the GMM–UBM outperforms the CNN, especially when the training data are limited. Finally, the effect of players on the individual violin recognition is investigated.","accessed":{"date-parts":[["2024",4,24]]},"author":[{"family":"Wang","given":"Qi"},{"family":"Bao","given":"Changchun"}],"citation-key":"wang2020a","container-title":"Electronics","container-title-short":"Electronics","DOI":"10.3390/electronics9060950","ISSN":"2079-9292","issue":"6","issued":{"date-parts":[["2020",6,8]]},"language":"en","license":"https://creativecommons.org/licenses/by/4.0/","page":"950","source":"Semantic Scholar","title":"Individual Violin Recognition Method Combining Tonal and Nontonal Features","type":"article-journal","URL":"https://www.mdpi.com/2079-9292/9/6/950","volume":"9"},
  {"id":"wiedzminyo2022","accessed":{"date-parts":[["2023",12,4]]},"author":[{"family":"wiedzminYo","given":""}],"citation-key":"wiedzminyo2022","container-title":"Signal Processing Stack Exchange","genre":"Forum post","issued":{"date-parts":[["2022",4,27]]},"title":"Does windowing affect Parseval's theorem?","type":"post","URL":"https://dsp.stackexchange.com/q/47598/62413"},
  {"id":"woodhouse2014","abstract":"To understand the design and function of the violin requires investigation of a range of scientific questions. This paper presents a review: the relevant physics covers the nonlinear vibration of a bowed string, the vibration of the instrument body, and the consequent sound radiation. Questions of discrimination and preference by listeners and players require additional studies using the techniques of experimental psychology, and these are also touched on in the paper. To address the concerns of players and makers of instruments requires study of the interaction of all these factors, coming together in the concept of 'playability' of an instrument.","author":[{"family":"Woodhouse","given":"Jim"}],"citation-key":"woodhouse2014","container-title":"Reports on Progress in Physics. Physical Society (Great Britain)","container-title-short":"Rep Prog Phys","DOI":"10.1088/0034-4885/77/11/115901","ISSN":"1361-6633","issue":"11","issued":{"date-parts":[["2014",11]]},"language":"eng","page":"115901","PMID":"25345563","source":"PubMed","title":"The acoustics of the violin: a review","title-short":"The acoustics of the violin","type":"article-journal","volume":"77"},
  {"id":"yokoyama2020","abstract":"In this study, the sounds of violins, performed by a violinist, were recorded and the distribution of peak frequencies of the spectral envelope of the recorded sound data was analyzed. The distribution of peak frequencies is different for each violin, but some tendencies were found. Questionnaires were used to examine the distinction in violin timbre by the difference in the patterns of peak frequencies. When the patterns of the two violins were similar, the subjects responded that the timbre of both violins was similar than the other violin whose pattern of peak frequencies was different. The present study discussed the contribution of the similarity of patterns and the difference between patterns to the identification of the timbre.","accessed":{"date-parts":[["2024",5,22]]},"author":[{"family":"Yokoyama","given":"Masao"}],"citation-key":"yokoyama2020","container-title":"Applied Acoustics","container-title-short":"Applied Acoustics","DOI":"10.1016/j.apacoust.2019.107006","ISSN":"0003-682X","issued":{"date-parts":[["2020",1,1]]},"page":"107006","source":"ScienceDirect","title":"Possibility of distinction of violin timbre by spectral envelope","type":"article-journal","URL":"https://www.sciencedirect.com/science/article/pii/S0003682X19302403","volume":"157"},
  {"id":"yokoyama2022","accessed":{"date-parts":[["2024",3,5]]},"author":[{"family":"Yokoyama","given":"Masao"},{"family":"Ishigaki","given":"Yuya"}],"citation-key":"yokoyama2022","DOI":"10.1121/2.0001659","event-place":"University of Music and Performing Arts, Vienna, Austria","event-title":"Fourth Vienna Talk on Music Acoustics","issued":{"date-parts":[["2022"]]},"language":"en","page":"035004","publisher-place":"University of Music and Performing Arts, Vienna, Austria","source":"DOI.org (Crossref)","title":"Identification of violin timbre by neural network using acoustic features","type":"paper-conference","URL":"https://pubs.aip.org/asa/poma/article/2842634"},
  {"id":"yokoyama2022a","abstract":"The timbre of violins is identified using machine learning, and a computer program is developed for the neural network using Python and Keras libraries. The 21 violins recorded include old Italian violins made by Stradivari and contemporary violins. The training and test data use the spectrum envelope and Mel-frequency cepstrum coefficients (MFCC). The accuracy of the identification test in the case of open strings is greater than 90%. Furthermore, experiments that predict similarity in timbre of an unknown violin to that of trained violins are presented.","accessed":{"date-parts":[["2024",4,24]]},"author":[{"family":"Yokoyama","given":"Masao"},{"family":"Ishigaki","given":"Yuya"}],"citation-key":"yokoyama2022a","container-title":"Proceedings of Meetings on Acoustics","container-title-short":"Proceedings of Meetings on Acoustics","DOI":"10.1121/2.0001659","ISSN":"1939-800X","issue":"1","issued":{"date-parts":[["2022",12,22]]},"page":"035004","source":"Silverchair","title":"Identification of violin timbre by neural network using acoustic features","type":"article-journal","URL":"https://doi.org/10.1121/2.0001659","volume":"49"},
  {"id":"zanoni2017","abstract":"This contribution investigates on the acoustics of violin, and more speciﬁcally on the relationship existing between vibrational impulse responses and the timbre of the instrument. With respect to previous publications on this topic, we tackle the problem using a feature-based approach. More speciﬁcally, we aim at ﬁnding the correlation between the features extracted from accelerometric measurements of the bridge mobility and from audio recordings of a prescribed set of performances. Results demonstrate that features describing to the global shape of the spectrum are strongly related. On these descriptors we also show the possibility of predicting the features of audio recordings from the vibrational ones. Experimental data are based on a set of 25 modern violins.","author":[{"family":"Zanoni","given":"Massimiliano"},{"family":"Antonacci","given":"Fabio"},{"family":"Sarti","given":"Augusto"}],"citation-key":"zanoni2017","issued":{"date-parts":[["2017"]]},"language":"en","source":"Zotero","title":"Towards Prediction of Violin Timbre from Vibrational Measurements","type":"article-journal"},
  {"id":"zhao2022","abstract":"Modelling musical performers’ individual playing styles based on audio features is important for music education, music expression analysis and music generation. In violin performance, the perception of playing styles are mainly affected by the characteristic musical timbre, which is mostly determined by performers, instruments and recording conditions. To verify if timbre features can describe a performer’s style adequately, we examine a violinist identification method based on note-level timbre feature distributions. We first apply it using solo datasets to recognise professional violinists, then use it to identify master players from commercial concerto recordings. The results show that the designed features and method work very well for both datasets. The identification accuracy with the solo dataset using MFCCs and spectral constrast features are 0.94 and 0.91 respectively. Significantly lower but promising results are reported with the concerto dataset. Results suggest that the selected timbre features can model performers’ individual playing reasonably objectively, regardless of the instrument they play.","accessed":{"date-parts":[["2024",4,24]]},"author":[{"family":"Zhao","given":"Yudong"},{"family":"Fazekas","given":"Gyorgy"},{"family":"Sandler","given":"Mark"}],"citation-key":"zhao2022","container-title":"ICASSP 2022 - 2022 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP)","DOI":"10.1109/ICASSP43922.2022.9747606","event-place":"Singapore, Singapore","ISBN":"9781665405409","issued":{"date-parts":[["2022",5,23]]},"license":"https://doi.org/10.15223/policy-029","page":"601-605","publisher":"IEEE","publisher-place":"Singapore, Singapore","source":"Semantic Scholar","title":"Violinist Identification Using Note-Level Timbre Feature Distributions","type":"article-journal","URL":"https://ieeexplore.ieee.org/document/9747606/"},
  {"id":"zotero-105","accessed":{"date-parts":[["2023",5,19]]},"citation-key":"zotero-105","title":"Philippe Lalitte - L'expressivité de la performance des Dix pièces pour quintette à vent de Ligeti (Musimédiane 9)","type":"webpage","URL":"https://www.musimediane.com/numero9/LALITTE/"},
  {"id":"zotero-108","citation-key":"zotero-108","language":"fr","source":"Zotero","title":"Projet de recherche doctorale au sein du Collegium Musicae","type":"article-journal"},
  {"id":"zotero-515","accessed":{"date-parts":[["2023",11,9]]},"citation-key":"zotero-515","title":"Spectral Descriptors - MATLAB & Simulink - MathWorks France","type":"webpage","URL":"https://fr.mathworks.com/help/audio/ug/spectral-descriptors.html#SpectralDescriptorsExample-1"},
  {"id":"zotero-525","accessed":{"date-parts":[["2023",11,9]]},"citation-key":"zotero-525","title":"Learn FluCoMa","type":"webpage","URL":"https://learn.flucoma.org/reference/spectralshape/"},
  {"id":"zotero-542","abstract":"Explore and run machine learning code with Kaggle Notebooks | Using data from multiple data sources","accessed":{"date-parts":[["2023",11,13]]},"citation-key":"zotero-542","language":"en","title":"Comprehensive Guide on Feature Selection","type":"webpage","URL":"https://kaggle.com/code/prashant111/comprehensive-guide-on-feature-selection"},
  {"id":"zotero-546","abstract":"Feature engineering is the process of using domain knowledge to extract features from raw data via data mining techniques. These features can be used to improve the performance of machine learning ...","accessed":{"date-parts":[["2023",11,13]]},"citation-key":"zotero-546","container-title":"GitHub","language":"en","title":"Amazing-Feature-Engineering/A Short Guide for Feature Engineering and Feature Selection.md at master · ashishpatel26/Amazing-Feature-Engineering","type":"webpage","URL":"https://github.com/ashishpatel26/Amazing-Feature-Engineering/blob/master/A%20Short%20Guide%20for%20Feature%20Engineering%20and%20Feature%20Selection.md"},
  {"id":"zotero-549","abstract":"The Book of Statistical Proofs – a centralized, open and collaboratively edited archive of statistical theorems for the computational sciences","accessed":{"date-parts":[["2023",11,14]]},"citation-key":"zotero-549","container-title":"The Book of Statistical Proofs","language":"en","title":"The Book of Statistical Proofs","type":"webpage","URL":"https://statproofbook.github.io/"},
  {"id":"zotero-551","accessed":{"date-parts":[["2023",11,28]]},"citation-key":"zotero-551","title":"Invertibility of overlap-add processing","type":"webpage","URL":"https://gauss256.github.io/blog/cola.html"},
  {"id":"zotero-552","abstract":"Supplementary Materials for the AES Tutorial on Scaling of the Discrete Fourier Transform, see the pages:","accessed":{"date-parts":[["2023",11,28]]},"citation-key":"zotero-552","container-title":"Scaling of the DFT and Some More of Its Noteworthy Properties","language":"en-US","title":"Scaling of the DFT and Some More of Its Noteworthy Properties","type":"webpage","URL":"https://appliedacousticschalmers.github.io/scaling-of-the-dft/AES2020_eBrief/"},
  {"id":"zotero-562","accessed":{"date-parts":[["2023",11,28]]},"citation-key":"zotero-562","title":"Preface — Digital Signals Theory","type":"webpage","URL":"https://brianmcfee.net/dstbook-site/content/intro.html"},
  {"id":"zotero-572","accessed":{"date-parts":[["2023",12,14]]},"citation-key":"zotero-572","title":"cegeme/iracema","type":"webpage","URL":"https://github.com/cegeme/iracema/tree/develop"},
  {"id":"zotero-573","accessed":{"date-parts":[["2023",12,14]]},"citation-key":"zotero-573","title":"VincentPerreault0/timbretoolbox: A toolbox for extracting audio descriptors in MATLAB.","type":"webpage","URL":"https://github.com/VincentPerreault0/timbretoolbox/tree/master"},
  {"id":"zotero-591","accessed":{"date-parts":[["2024",2,21]]},"citation-key":"zotero-591","title":"The Feynman Lectures on Physics","type":"webpage","URL":"https://www.feynmanlectures.caltech.edu/"},
  {"id":"zotero-715","abstract":"Meyda is a Javascript audio feature extraction library. Meyda supports both offline feature extraction as well as real-time feature extraction using the Web Audio API.","accessed":{"date-parts":[["2024",9,20]]},"citation-key":"zotero-715","container-title":"Meyda: Javascript Audio Feature Extraction","language":"en","title":"What is an Audio Feature?","type":"webpage","URL":"https://meyda.js.org/audio-features.html"},
  {"id":"zotero-723","accessed":{"date-parts":[["2024",9,22]]},"citation-key":"zotero-723","language":"en","title":"10.4 - Two-Way ANOVA | STAT 500","type":"webpage","URL":"https://online.stat.psu.edu/stat500/lesson/10/10.4"},
  {"id":"zotero-729","accessed":{"date-parts":[["2024",9,22]]},"citation-key":"zotero-729","title":"One-Factor ANOVA (Between Subjects)","type":"webpage","URL":"https://onlinestatbook.com/2/analysis_of_variance/one-way.html"}
]
